Функция УбратьЗапрещенныеЗнаки(ВхТекст)
	СтрТемп=ВхТекст;
	СтрТемп=СтрЗаменить(СтрТемп,"\","");
	СтрТемп=СтрЗаменить(СтрТемп,"/","");
	СтрТемп=СтрЗаменить(СтрТемп,"|","");
	СтрТемп=СтрЗаменить(СтрТемп,":","");
	СтрТемп=СтрЗаменить(СтрТемп,"*","");
	СтрТемп=СтрЗаменить(СтрТемп,"?","");
	СтрТемп=СтрЗаменить(СтрТемп,"""","");
	СтрТемп=СтрЗаменить(СтрТемп,"<","");
	СтрТемп=СтрЗаменить(СтрТемп,">","");
	Возврат СтрТемп;
КонецФункции

Процедура КнопкаВыполнитьНажатие(Кнопка)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КорСчет", 			ПланыСчетов.Хозрасчетный.Продажи);
	Запрос.УстановитьПараметр("ЮрАдрес",			Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Запрос.УстановитьПараметр("Счет41", 			ПланыСчетов.Хозрасчетный.Товары);
	Запрос.УстановитьПараметр("ВидСубконто", 		ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	Запрос.УстановитьПараметр("СписокОрганизаций", 	Организация);
	Запрос.УстановитьПараметр("ДатаНач", 			НачПериода);
	Запрос.УстановитьПараметр("ДатаКон", 			КонецДня(КонПериода));
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ХозрасчетныйОбороты.Регистратор.Контрагент КАК Контрагент
	             |ИЗ
	             |	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, &ДатаКон, Регистратор, Счет В ИЕРАРХИИ (&Счет41), &ВидСубконто, Организация В (&СписокОрганизаций), КорСчет В ИЕРАРХИИ (&КорСчет), ) КАК ХозрасчетныйОбороты
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбАлкогольнойПродукции КАК СведенияОбАлкогольнойПродукции
	             |		ПО ХозрасчетныйОбороты.Субконто1 = СведенияОбАлкогольнойПродукции.Номенклатура
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Контрагент";
	Выборка=Запрос.Выполнить().Выбрать();
	ЭлементыФормы.Индикатор.МаксимальноеЗначение=Выборка.Количество()-1;
	Индикатор=0;
	Пока Выборка.Следующий() Цикл		
		Если ЗначениеЗаполнено(Выборка.Контрагент) Тогда
			Декл=ПечатьДекларации(Выборка.Контрагент);
			Декл.Записать(Каталог+"\"+УбратьЗапрещенныеЗнаки(Выборка.Контрагент.Наименование)+"("+ПредставлениеПериода(НачПериода,КонецДня(КонПериода))+").xls",ТипФайлаТабличногоДокумента.XLS);
			Индикатор=Индикатор+1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры


Функция ПечатьДекларации(Контрагент)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КорСчет", 			ПланыСчетов.Хозрасчетный.Продажи);
	Запрос.УстановитьПараметр("ЮрАдрес",			Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Запрос.УстановитьПараметр("Счет41", 			ПланыСчетов.Хозрасчетный.Товары);
	Запрос.УстановитьПараметр("ВидСубконто", 		ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	Запрос.УстановитьПараметр("СписокОрганизаций", 	Организация);
	Запрос.УстановитьПараметр("ДатаНач", 			НачПериода);
	Запрос.УстановитьПараметр("ДатаКон", 			КонецДня(КонПериода));
	Запрос.УстановитьПараметр("Контрагент",			Контрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОбАлкогольнойПродукции.НаименованиеВида169 КАК П000010000101,
	|	СведенияОбАлкогольнойПродукции.КодВида169 КАК П000010000102,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.НаименованиеПолное КАК СТРОКА(200))
	|	КОНЕЦ КАК П000010000103,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.ИНН
	|		ИНАЧЕ СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.ИНН
	|	КОНЕЦ КАК П000010000104,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.КПП
	|		ИНАЧЕ СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.КПП
	|	КОНЕЦ КАК П000010000105,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Регистратор.Грузополучатель ЕСТЬ НЕ NULL 
	|				И ХозрасчетныйОбороты.Регистратор.Контрагент.КПП <> ХозрасчетныйОбороты.Регистратор.Грузополучатель.КПП
	|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Регистратор.Грузополучатель.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Регистратор.Контрагент.НаименованиеПолное КАК СТРОКА(200))
	|	КОНЕЦ КАК П000010000106,
	|	ХозрасчетныйОбороты.Регистратор.Контрагент.ИНН КАК П000010000108,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Регистратор.Грузополучатель ЕСТЬ НЕ NULL 
	|				И ХозрасчетныйОбороты.Регистратор.Контрагент.КПП <> ХозрасчетныйОбороты.Регистратор.Грузополучатель.КПП
	|			ТОГДА ХозрасчетныйОбороты.Регистратор.Грузополучатель.КПП
	|		ИНАЧЕ ХозрасчетныйОбороты.Регистратор.Контрагент.КПП
	|	КОНЕЦ КАК П000010000109,
	|	"""" КАК П000010000110,
	|	"""" КАК П000010000111,
	|	"""" КАК П000010000113,
	|	"""" КАК П000010000114,
	|	"""" КАК П000010000115,
	|	ХозрасчетныйОбороты.Регистратор.Дата КАК П000010000117,
	|	ХозрасчетныйОбороты.Регистратор.Номер КАК П000010000118,
	|	"""" КАК П000010000119,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|				ТОГДА 0
	|			ИНАЧЕ ХозрасчетныйОбороты.КоличествоОборотКт * СведенияОбАлкогольнойПродукции.КоэффПересчетаДал
	|		КОНЕЦ) КАК П000010000120,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Регистратор.Грузополучатель ЕСТЬ НЕ NULL 
	|				И ХозрасчетныйОбороты.Регистратор.Контрагент.КПП <> ХозрасчетныйОбороты.Регистратор.Грузополучатель.КПП
	|			ТОГДА ХозрасчетныйОбороты.Регистратор.Грузополучатель
	|		ИНАЧЕ ХозрасчетныйОбороты.Регистратор.Контрагент
	|	КОНЕЦ КАК Контрагент
	|ИЗ
	|	РегистрСведений.СведенияОбАлкогольнойПродукции КАК СведенияОбАлкогольнойПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, &ДатаКон, Регистратор, Счет В ИЕРАРХИИ (&Счет41), &ВидСубконто, Организация В (&СписокОрганизаций), КорСчет В ИЕРАРХИИ (&КорСчет), ) КАК ХозрасчетныйОбороты
	|		ПО СведенияОбАлкогольнойПродукции.Номенклатура = ХозрасчетныйОбороты.Субконто1
	|ГДЕ
	|	ХозрасчетныйОбороты.КоличествоОборотКт > 0
	|	И ХозрасчетныйОбороты.Регистратор.Контрагент = &Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Регистратор.Контрагент,
	|	СведенияОбАлкогольнойПродукции.КодВида169,
	|	СведенияОбАлкогольнойПродукции.НаименованиеВида169,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.НаименованиеПолное КАК СТРОКА(200))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.ИНН
	|		ИНАЧЕ СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.ИНН
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.КПП
	|		ИНАЧЕ СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.КПП
	|	КОНЕЦ,
	|	ХозрасчетныйОбороты.Регистратор.Номер,
	|	ХозрасчетныйОбороты.Регистратор.Дата,
	|	ХозрасчетныйОбороты.Регистратор.Контрагент.ИНН,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Регистратор.Грузополучатель ЕСТЬ НЕ NULL 
	|				И ХозрасчетныйОбороты.Регистратор.Контрагент.КПП <> ХозрасчетныйОбороты.Регистратор.Грузополучатель.КПП
	|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Регистратор.Грузополучатель.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Регистратор.Контрагент.НаименованиеПолное КАК СТРОКА(200))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Регистратор.Грузополучатель ЕСТЬ НЕ NULL 
	|				И ХозрасчетныйОбороты.Регистратор.Контрагент.КПП <> ХозрасчетныйОбороты.Регистратор.Грузополучатель.КПП
	|			ТОГДА ХозрасчетныйОбороты.Регистратор.Грузополучатель.КПП
	|		ИНАЧЕ ХозрасчетныйОбороты.Регистратор.Контрагент.КПП
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Регистратор.Грузополучатель ЕСТЬ НЕ NULL 
	|				И ХозрасчетныйОбороты.Регистратор.Контрагент.КПП <> ХозрасчетныйОбороты.Регистратор.Грузополучатель.КПП
	|			ТОГДА ХозрасчетныйОбороты.Регистратор.Грузополучатель
	|		ИНАЧЕ ХозрасчетныйОбороты.Регистратор.Контрагент
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	П000010000102,
	|	П000010000103,
	|	П000010000106
	|ИТОГИ
	|	СУММА(П000010000120)
	|ПО
	|	ОБЩИЕ,
	|	Контрагент,
	|	П000010000103";
	Свед=УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация,ТекущаяДата());
	ВыборкаИтогов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтогов.Следующий();
	ВыборкаКонтрагентов=ВыборкаИтогов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НС = 1;
	Стр=Новый Структура("Организация,Номер",ЭтотОбъект.Организация,0);
	Отбор=Новый Структура("Поставщик");
	
	
	ТабДок=Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати="ПАРАМЕТРЫ_ПЕЧАТИ_ДЕКЛАРАЦИЯ_6";
	
	Макет=ПолучитьМакет("ФормаОтчета2012Кв3_Декларация");
	Область=Макет.ПолучитьОбласть("ШапкаДекларация");
	Область.Параметры.Организации=ФормированиеПечатныхФорм.ОписаниеОрганизации(Свед, "НаименованиеДляПечатныхФорм,ИНН,КПП,ФактическийАдрес");
	ТабДок.Вывести(Область);
	Область=Макет.ПолучитьОбласть("СтрокаДанных");
	
	Пока ВыборкаКонтрагентов.Следующий() Цикл
		ВыборкаПроизводителей=ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		СведенияОКонтрагенте    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаКонтрагентов.Контрагент);
		Адрес = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "ЮридическийАдрес,");
		Пока ВыборкаПроизводителей.Следующий() Цикл
			СтрокаЗапроса=ВыборкаПроизводителей.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока СтрокаЗапроса.Следующий() Цикл
				СтрокаЗаполнения=Макет.ПолучитьОбласть("СтрокаДанных");
				СтрокаЗаполнения.Параметры.П000010000100 = НС;
				ЗаполнитьЗначенияСвойств(СтрокаЗаполнения.Параметры, СтрокаЗапроса);
				Стр.Номер=СтрокаЗапроса.П000010000118;
				СтрокаЗаполнения.Параметры.П000010000118=ОбщегоНазначения.ПолучитьНомерНаПечать(Стр);
				СтрокаЗаполнения.Параметры.П000010000107=Адрес;
				
				Отбор.Поставщик=ВыборкаКонтрагентов.Контрагент;
				СвОЛиц=РегистрыСведений.ЛицензииПоставщиковАлкогольнойПродукции.СрезПоследних(КонПериода,Отбор);
				Если СвОЛиц.Количество() Тогда
					Лиц=СвОЛиц.Получить(0);
					СерияНомер=ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Лиц.СерияНомер," ");
					СтрокаЗаполнения.Параметры.П000010000121=СерияНомер[0];
					СтрокаЗаполнения.Параметры.П000010000122=СерияНомер[1];
					СтрокаЗаполнения.Параметры.П000010000111=Лиц.Период;
					СтрокаЗаполнения.Параметры.П000010000112=Лиц.ДатаОкончания;
					СтрокаЗаполнения.Параметры.П000010000113=Лиц.КемВыдана;
				КонецЕсли;
				СтрокаЗаполнения.Параметры.П000010000115=ПривестиНомерНаПечать(СтрокаЗапроса.П000010000115);
				СтрокаЗаполнения.Параметры.П000010000118=ПривестиНомерНаПечать(СтрокаЗапроса.П000010000118);
				ТабДок.Вывести(СтрокаЗаполнения);
				НС = НС + 1;
			КонецЦикла;
			СтрокаЗаполнения=Макет.ПолучитьОбласть("Подитого");
			ЗаполнитьЗначенияСвойств(СтрокаЗаполнения.Параметры,ВыборкаПроизводителей);
			ТабДок.Вывести(СтрокаЗаполнения);
		КонецЦикла;
		СтрокаЗаполнения=Макет.ПолучитьОбласть("Подитого");
		ЗаполнитьЗначенияСвойств(СтрокаЗаполнения.Параметры,ВыборкаКонтрагентов);
		СтрокаЗаполнения.Параметры.П000010000105=ВыборкаКонтрагентов.Контрагент.КПП;
		ТабДок.Вывести(СтрокаЗаполнения);
	КонецЦикла;
	СтрокаЗаполнения=Макет.ПолучитьОбласть("Итого");
	ЗаполнитьЗначенияСвойств(СтрокаЗаполнения.Параметры,ВыборкаИтогов);
	ТабДок.Вывести(СтрокаЗаполнения);
	
	//Вывод итого по производителям
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОбАлкогольнойПродукции.КодВида169 КАК П000010000102,
		|	ВЫБОР
		|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.НаименованиеПолное КАК СТРОКА(200))
		|		ИНАЧЕ ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.НаименованиеПолное КАК СТРОКА(200))
		|	КОНЕЦ КАК П000010000103,
		|	СУММА(ВЫБОР
		|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
		|				ТОГДА 0
		|			ИНАЧЕ ХозрасчетныйОбороты.КоличествоОборотКт * СведенияОбАлкогольнойПродукции.КоэффПересчетаДал
		|		КОНЕЦ) КАК П000010000120
		|ИЗ
		|	РегистрСведений.СведенияОбАлкогольнойПродукции КАК СведенияОбАлкогольнойПродукции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, &ДатаКон, Регистратор, Счет В ИЕРАРХИИ (&Счет41), &ВидСубконто, Организация В (&СписокОрганизаций), КорСчет В ИЕРАРХИИ (&КорСчет), ) КАК ХозрасчетныйОбороты
		|		ПО СведенияОбАлкогольнойПродукции.Номенклатура = ХозрасчетныйОбороты.Субконто1
		|ГДЕ
		|	ХозрасчетныйОбороты.КоличествоОборотКт > 0
		|	И ХозрасчетныйОбороты.Регистратор.Контрагент = &Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.Регистратор.Контрагент,
		|	СведенияОбАлкогольнойПродукции.КодВида169,
		|	ВЫБОР
		|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.НаименованиеПолное КАК СТРОКА(200))
		|		ИНАЧЕ ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.НаименованиеПолное КАК СТРОКА(200))
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	П000010000102
		|ИТОГИ
		|	СУММА(П000010000120)
		|ПО
		|	П000010000103,
		|	П000010000102";

	Результат = Запрос.Выполнить();

	ВыборкаП000010000103 = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаП000010000103.Следующий() Цикл
		// Вставить обработку выборки ВыборкаП000010000103

		ВыборкаП000010000102 = ВыборкаП000010000103.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаП000010000102.Следующий() Цикл
			СтрокаЗаполнения=Макет.ПолучитьОбласть("ИтогоПроизводительКод");
			ЗаполнитьЗначенияСвойств(СтрокаЗаполнения.Параметры,ВыборкаП000010000102);
			ТабДок.Вывести(СтрокаЗаполнения);
		КонецЦикла;
	КонецЦикла;
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	//Возвраты
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОбАлкогольнойПродукции.НаименованиеВида169 КАК П000010000101,
	|	СведенияОбАлкогольнойПродукции.КодВида169 КАК П000010000102,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.НаименованиеПолное КАК СТРОКА(200))
	|	КОНЕЦ КАК П000010000103,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.ИНН
	|		ИНАЧЕ СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.ИНН
	|	КОНЕЦ КАК П000010000104,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.КПП
	|		ИНАЧЕ СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.КПП
	|	КОНЕЦ КАК П000010000105,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Регистратор.Контрагент.НаименованиеПолное КАК СТРОКА(200)) КАК П000010000106,
	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100)) КАК П000010000107,
	|	ХозрасчетныйОбороты.Регистратор.Контрагент.ИНН КАК П000010000108,
	|	ХозрасчетныйОбороты.Регистратор.Контрагент.КПП КАК П000010000109,
	|	"""" КАК П000010000110,
	|	"""" КАК П000010000111,
	|	"""" КАК П000010000113,
	|	"""" КАК П000010000114,
	|	"""" КАК П000010000115,
	|	-ХозрасчетныйОбороты.КоличествоОборотКт * СведенияОбАлкогольнойПродукции.КоэффПересчетаДал КАК П000010000116,
	|	ХозрасчетныйОбороты.Регистратор.ДатаВходящегоДокумента КАК П000010000117,
	|	ХозрасчетныйОбороты.Регистратор.НомерВходящегоДокумента КАК П000010000118,
	|	"""" КАК П000010000119,
	|	СУММА(-ХозрасчетныйОбороты.КоличествоОборотКт * СведенияОбАлкогольнойПродукции.КоэффПересчетаДал) КАК П000010000120,
	|	ХозрасчетныйОбороты.Регистратор.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.СведенияОбАлкогольнойПродукции КАК СведенияОбАлкогольнойПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНач, &ДатаКон, Регистратор, Счет В ИЕРАРХИИ (&Счет41), &ВидСубконто, Организация В (&СписокОрганизаций), КорСчет В ИЕРАРХИИ (&КорСчет), ) КАК ХозрасчетныйОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ПО ХозрасчетныйОбороты.Регистратор.Контрагент = КонтактнаяИнформация.Объект
	|				И (КонтактнаяИнформация.Вид = &ЮрАдрес)
	|		ПО СведенияОбАлкогольнойПродукции.Номенклатура = ХозрасчетныйОбороты.Субконто1
	|ГДЕ
	|	ХозрасчетныйОбороты.Регистратор.Контрагент = &Контрагент
	|	И ХозрасчетныйОбороты.КоличествоОборотКт < 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Регистратор.Контрагент,
	|	СведенияОбАлкогольнойПродукции.КодВида169,
	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100)),
	|	СведенияОбАлкогольнойПродукции.НаименованиеВида169,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.НаименованиеПолное КАК СТРОКА(200))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.ИНН
	|		ИНАЧЕ СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.ИНН
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СведенияОбАлкогольнойПродукции.Номенклатура.Производитель.КПП
	|		ИНАЧЕ СведенияОбАлкогольнойПродукции.Номенклатура.Импортер.КПП
	|	КОНЕЦ,
	|	ХозрасчетныйОбороты.Регистратор.Контрагент.ИНН,
	|	-ХозрасчетныйОбороты.КоличествоОборотКт * СведенияОбАлкогольнойПродукции.КоэффПересчетаДал,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Регистратор.Контрагент.НаименованиеПолное КАК СТРОКА(200)),
	|	ХозрасчетныйОбороты.Регистратор.Контрагент.КПП,
	|	ХозрасчетныйОбороты.Регистратор.ДатаВходящегоДокумента,
	|	ХозрасчетныйОбороты.Регистратор.НомерВходящегоДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	П000010000102,
	|	П000010000106
	|ИТОГИ
	|	СУММА(П000010000116),
	|	СУММА(П000010000120)
	|ПО
	|	ОБЩИЕ,
	|	Контрагент";
	
	ВыборкаИтогов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтогов.Следующий();
	ВыборкаКонтрагентов=ВыборкаИтогов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НС = 1;
	Стр=Новый Структура("Организация,Номер",ЭтотОбъект.Организация,0);
	Отбор=Новый Структура("Поставщик");
	
	
	Область=Макет.ПолучитьОбласть("ШапкаВозврат");
	Область.Параметры.Организации=Область.Параметры.Организации=ФормированиеПечатныхФорм.ОписаниеОрганизации(Свед, "НаименованиеДляПечатныхФорм,ИНН,КПП,ФактическийАдрес");
	ТабДок.Вывести(Область);
	Область=Макет.ПолучитьОбласть("СтрокаДанных");
	
	Пока ВыборкаКонтрагентов.Следующий() Цикл
		
		СведенияОКонтрагенте    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаКонтрагентов.Контрагент);
		Адрес = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "ФактическийАдрес,");
		СтрокаЗапроса=ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока СтрокаЗапроса.Следующий() Цикл
			СтрокаЗаполнения=Макет.ПолучитьОбласть("СтрокаДанных");
			СтрокаЗаполнения.Параметры.П000010000100 = НС;
			ЗаполнитьЗначенияСвойств(СтрокаЗаполнения.Параметры, СтрокаЗапроса);
			//Стр.Номер=СтрокаЗапроса.П000010000118;
			//СтрокаЗаполнения.Параметры.П000010000118=ОбщегоНазначения.ПолучитьНомерНаПечать(Стр);
			СтрокаЗаполнения.Параметры.П000010000107=Адрес;
			
			Отбор.Поставщик=ВыборкаКонтрагентов.Контрагент;
			СвОЛиц=РегистрыСведений.ЛицензииПоставщиковАлкогольнойПродукции.СрезПоследних(КонПериода,Отбор);
			Если СвОЛиц.Количество() Тогда
				Лиц=СвОЛиц.Получить(0);
				СерияНомер=ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Лиц.СерияНомер," ");
				СтрокаЗаполнения.Параметры.П000010000121=СерияНомер[0];
				СтрокаЗаполнения.Параметры.П000010000122=СерияНомер[1];
				СтрокаЗаполнения.Параметры.П000010000111=Лиц.Период;
				СтрокаЗаполнения.Параметры.П000010000112=Лиц.ДатаОкончания;
				СтрокаЗаполнения.Параметры.П000010000113=Лиц.КемВыдана;
			КонецЕсли;
			СтрокаЗаполнения.Параметры.П000010000115=ПривестиНомерНаПечать(СтрокаЗапроса.П000010000115);
			СтрокаЗаполнения.Параметры.П000010000118=ПривестиНомерНаПечать(СтрокаЗапроса.П000010000118);
			ТабДок.Вывести(СтрокаЗаполнения);
			НС = НС + 1;
		КонецЦикла;
		СтрокаЗаполнения=Макет.ПолучитьОбласть("Итого");
		ЗаполнитьЗначенияСвойств(СтрокаЗаполнения.Параметры,ВыборкаКонтрагентов);
		ТабДок.Вывести(СтрокаЗаполнения);
	КонецЦикла;
	СтрокаЗаполнения=Макет.ПолучитьОбласть("Итого");
	ЗаполнитьЗначенияСвойств(СтрокаЗаполнения.Параметры,ВыборкаИтогов);
	ТабДок.Вывести(СтрокаЗаполнения);
	
	
	Возврат ТабДок;
КонецФункции

Функция ПривестиНомерНаПечать(Номер)
	ТемпНомер=Номер;
	Если ЗначениеЗаполнено(ТемпНомер) Тогда
		Пока НЕ ((Лев(ТемпНомер,1)>="1" И Лев(ТемпНомер,1)<="9")) Цикл
			ТемпНомер=Сред(ТемпНомер,2);
		КонецЦикла;
		Возврат ТемпНомер;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции


Процедура КаталогНачалоВыбора(Элемент, СтандартнаяОбработка)
	Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог=Каталог;
	Диалог.Заголовок="Выберите каталог для сохранения файлов деклараций";
	Если Диалог.Выбрать() Тогда
		Каталог=Диалог.Каталог;
	КонецЕсли;
		
	
КонецПроцедуры
//Андрей
