
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ОбСхема=Схема.ПолучитьОбъект();
	Для Каждого СтрокаПродавец Из Продавцы Цикл
		Для Каждого СтрокаПокупатель Из Покупатели Цикл
			СтрокаТЧ=ОбСхема.Состав.Добавить();
			СтрокаТЧ.Договор1=ПолучитьДоговорПродажи(СтрокаПродавец.Контрагент,СтрокаПокупатель.Контрагент);
			СтрокаТЧ.Договор2=ПолучитьДоговорПокупки(СтрокаПродавец.Контрагент,СтрокаПокупатель.Контрагент);
			СтрокаТЧ.ЗависимОт=Уровень-1;
			СтрокаТЧ.НомерШага=Уровень;
		КонецЦикла;
	КонецЦикла;
	ОбСхема.ПолучитьФорму().Открыть();
КонецПроцедуры

Функция ПолучитьДоговорПродажи(Продавец, Покупатель)
	
	Отбор=Новый Структура("Контрагент");
	Набор=РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Таб=Набор.Выгрузить();
	Организация	=Таб.Найти(Продавец,"Контрагент").Организация;
	Контрагент	=Покупатель;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.Организация = &Организация
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";

	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Договор=Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		Договор.Владелец		= Контрагент;
		Договор.Организация		= Организация;
		Договор.Наименование	= Организация.Наименование +" продает "+Контрагент.Наименование;
		Договор.ВидДоговора		= Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
		Форма=Договор.ПолучитьФорму();
		Форма.Открыть();
		Договор.Записать();
		Форма.Закрыть();
	Иначе
		Выборка=Результат.Выбрать();
		Выборка.Следующий();
		Договор=Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Договор.Ссылка;
КонецФункции

Функция ПолучитьДоговорПокупки(Продавец, Покупатель)
	
	Отбор=Новый Структура("Контрагент");
	Набор=РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Таб=Набор.Выгрузить();
	Организация	=Таб.Найти(Покупатель,"Контрагент").Организация;
	Контрагент	=Продавец;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.Организация = &Организация
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";

	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Договор=Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		Договор.Владелец		= Контрагент;
		Договор.Организация		= Организация;
		Договор.Наименование	= Организация.Наименование +" покупает у "+Контрагент.Наименование;
		Договор.ВидДоговора		= Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		Форма=Договор.ПолучитьФорму();
		Форма.Открыть();
		Договор.Записать();
		Форма.Закрыть();
	Иначе
		Выборка=Результат.Выбрать();
		Выборка.Следующий();
		Договор=Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Договор.Ссылка;
КонецФункции

