
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ЧтениеXML=Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Путь);
	
	ТЗ=СериализаторXDTO.ПрочитатьXML(ЧтениеXML,Тип("ТаблицаЗначений"));
	
	ТекНомер="";
	Об=Неопределено;
	Для каждого СтрокаТЧ из ТЗ Цикл
		Если СтрокаТЧ.Номер<>ТекНомер Тогда
			Док=Документы.ПоступлениеТоваровУслуг.НайтиПоНомеру(СтрокаТЧ.Номер,СтрокаТЧ.Дата);
			Если ЗначениеЗаполнено(Док) Тогда
				Если Об<>Неопределено и Об.Модифицированность() Тогда
					Об.Записать();
				КонецЕсли;
					
				Об=Док.ПолучитьОбъект();
				ТекНомер=СтрокаТЧ.Номер;
			Иначе
				ТекНомер="";
				Об=Неопределено;
			КонецЕсли;
		КонецЕсли;
		Если Об<>Неопределено Тогда
			Попытка
				СтрокаИсправления=Об.Товары[СтрокаТЧ.НомерСтроки-1];
				Если СтрокаИсправления.Номенклатура.Код<>СтрокаТЧ.КодНоменклатуры Тогда
					//какая-то херня
				ИначеЕсли СтрокаИсправления.ДатаРозлива<>СтрокаТЧ.ДатаРозлива Тогда
					СтрокаИсправления.ДатаРозлива=СтрокаТЧ.ДатаРозлива;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Если Об<>Неопределено и Об.Модифицированность() Тогда
		Об.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ПутьНачалоВыбора(Элемент, СтандартнаяОбработка)
	Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр="XML|*.xml";
	Если Диалог.Выбрать() Тогда
		Путь=Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры
