
Процедура КнопкаВыполнитьНажатие(Кнопка)
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка КАК РОТ,
		|	РеализацияТоваровУслуг.Ссылка КАК РТУ
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РасходныйОрдерНаТовары.ДокументПередачи = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РасходныйОрдерНаТовары.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И РасходныйОрдерНаТовары.Проведен
		|	И РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете";
	
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("ДатаНач", НачПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ЭлементыФормы.Индикатор.МаксимальноеЗначение=ВыборкаДетальныеЗаписи.Количество();
	Индикатор=0;
	Набор=РегистрыНакопления.ТоварыОрганизацийБУ.СоздатьНаборЗаписей();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//1. Убираем движения с расходников.
		Набор.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.РОТ);
		Набор.Прочитать();
		Набор.Очистить();
		Набор.Записать();
		
		Набор.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.РТУ);
		Набор.Прочитать();
		Набор.Очистить();
		//2. Движения переносим на реализацию
		Для Каждого СтрокаТЧ Из ВыборкаДетальныеЗаписи.РТУ.Товары Цикл
			Запись=набор.ДобавитьРасход();
			Запись.Качество=Справочники.Качество.Новый;
			Запись.Квартал=НачалоКвартала(ВыборкаДетальныеЗаписи.РТУ.Дата);
			Запись.Количество=СтрокаТЧ.Количество;
			Запись.Номенклатура=СтрокаТЧ.Номенклатура;
			Запись.Организация=ВыборкаДетальныеЗаписи.РТУ.Организация;
			Запись.Период=ВыборкаДетальныеЗаписи.РТУ.Дата;
			Запись.Регистратор=ВыборкаДетальныеЗаписи.РТУ;
			Запись.Склад=ВыборкаДетальныеЗаписи.РТУ.Склад;
		КонецЦикла;
		Набор.Записать();
		Индикатор=Индикатор+1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры
