Функция ПроверитьОтчетОРознПродажах(ОтчетОРознПродажах)
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка,
		|	ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
		|	КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
		|	СУММА(ОтчетОРозничныхПродажахТовары.Количество * КомплектующиеНоменклатуры.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Продажи
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
		|		ПО (КомплектующиеНоменклатуры.Номенклатура = ОтчетОРозничныхПродажахТовары.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|		ПО ОтчетОРозничныхПродажахТовары.Ссылка = ОтчетОРозничныхПродажах.Ссылка
		|ГДЕ
		|	ОтчетОРозничныхПродажах.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетОРозничныхПродажах.Ссылка,
		|	ОтчетОРозничныхПродажахТовары.Номенклатура,
		|	КомплектующиеНоменклатуры.Комплектующая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СборкаТоваров.ДокументОснование КАК ДокументОснование,
		|	СборкаТоваров.Номенклатура КАК Номенклатура,
		|	СборкаТоваровТовары.Номенклатура КАК Номенклатура1,
		|	СУММА(СборкаТоваровТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Списание
		|ИЗ
		|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаТоваров
		|		ПО СборкаТоваровТовары.Ссылка = СборкаТоваров.Ссылка
		|ГДЕ
		|	СборкаТоваров.ДокументОснование.Ссылка = &Ссылка
		|	И СборкаТоваров.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	СборкаТоваров.ДокументОснование,
		|	СборкаТоваров.Номенклатура,
		|	СборкаТоваровТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Комплектующая КАК Комплектующая,
		|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Продажи.Ссылка КАК Ссылка,
		|		ВТ_Продажи.Номенклатура КАК Номенклатура,
		|		ВТ_Продажи.Комплектующая КАК Комплектующая,
		|		ВТ_Продажи.Количество КАК Количество
		|	ИЗ
		|		ВТ_Продажи КАК ВТ_Продажи
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_Списание.ДокументОснование,
		|		ВТ_Списание.Номенклатура,
		|		ВТ_Списание.Номенклатура1,
		|		-ВТ_Списание.Количество
		|	ИЗ
		|		ВТ_Списание КАК ВТ_Списание) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Комплектующая
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.Количество) <> 0";
	
	Запрос.УстановитьПараметр("Ссылка", ОтчетОРознПродажах);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();

КонецФункции // ПроверитьОтчетОРознПродажаъ()


&НаСервере
Процедура ПроверкаНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОРозничныхПродажах.Ссылка
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|ГДЕ
		|	ОтчетОРозничныхПродажах.Магазин = &Магазин
		|	И ОтчетОРозничныхПродажах.Проведен";
	
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ПроверитьОтчетОРознПродажах(ВыборкаДетальныеЗаписи.Ссылка) Тогда
			Сообщить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Проверка(Команда)
	ПроверкаНаСервере();
КонецПроцедуры

