ДатаПартионногоУчета=Последовательности.ПартионныйУчет.ПолучитьГраницу().Дата;
//НачатьТранзакцию();
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	ПоступлениеТоваровУслуг.Ссылка
               |ИЗ
               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
               |ГДЕ
               |	ПоступлениеТоваровУслуг.Проведен
               |	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом
               |	И ПоступлениеТоваровУслуг.Дата > ДАТАВРЕМЯ(2016, 7, 14)
               |
               |УПОРЯДОЧИТЬ ПО
               |	ПоступлениеТоваровУслуг.Дата";

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Об.ДокументыРасчетовСКонтрагентом.Очистить();
	УправлениеВзаиморасчетами.ЗаполнитьПредоплату(Об, Об.мСтруктураПараметровВзаиморасчетов);
	Об.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;
//ОтменитьТранзакцию();
Последовательности.ПартионныйУчет.УстановитьГраницу(ДатаПартионногоУчета);
