
Процедура КнопкаВыполнитьНажатие(Кнопка)
	//1. Получение остатков
	Остатки=РегистрыНакопления.ТоварыКПередачеОрганизаций.Остатки();
	
	//2. Наборы движений
	НаборТоварыКПередаче		= РегистрыНакопления.ТоварыКПередачеОрганизаций.СоздатьНаборЗаписей();
	НаборТоварыКПередаче.Отбор.Регистратор.Установить(ДокКорр);
	
	НаборТоварыОрганизацийУУ	= РегистрыНакопления.ТоварыОрганизаций.СоздатьНаборЗаписей();
	НаборТоварыОрганизацийУУ.Отбор.Регистратор.Установить(ДокКорр);
	
	НаборТоварыОрганизацийБУ	= РегистрыНакопления.ТоварыОрганизацийБУ.СоздатьНаборЗаписей();
	НаборТоварыОрганизацийБУ.Отбор.Регистратор.Установить(ДокКорр);
	
	Для Каждого СтрокаТЧ Из Остатки Цикл
		Запись=НаборТоварыКПередаче.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Запись,СтрокаТЧ);
		Запись.Регистратор=ДокКорр;
		Запись.Период=ДокКорр.Дата;
		
		Если СтрокаТЧ.Количество>0 Тогда //уберем с ТО
			Запись=НаборТоварыОрганизацийУУ.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(Запись,СтрокаТЧ);
			Запись.Регистратор=ДокКорр;
			Запись.Период=ДокКорр.Дата;
			Если СтрокаТЧ.ДокументПередачи.ОтражатьВБухгалтерскомУчете Тогда
				Запись=НаборТоварыОрганизацийБУ.ДобавитьРасход();
				ЗаполнитьЗначенияСвойств(Запись,СтрокаТЧ);
				Запись.Регистратор=ДокКорр;
				Запись.Период=ДокКорр.Дата;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборТоварыКПередаче.Записать();
	НаборТоварыОрганизацийУУ.Записать();
	НаборТоварыОрганизацийБУ.Записать();
КонецПроцедуры
