//Для совместимости
Функция ПоддерживаетсяВидТО(Вид) Экспорт

	Результат = Ложь;

	Если Вид = Перечисления.ВидыТорговогоОборудования.ККМOffLine Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;

КонецФункции // Поддержив

//ПРОЦЕДУРЫ ОБЪЕКТОВ НА ФОРМЕ                              
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ПолучитьСерверТО().ПодключитьКлиента(ЭтаФорма);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТорговоеОборудование.Модель.ОбработкаОбслуживания КАК ОбработкаОбслуживания,
		|	ТорговоеОборудование.КассаККМ.Ссылка КАК КассаККМ,
		|	ТорговоеОборудование.Идентификатор КАК ID,
		|	ТорговоеОборудование.КассаККМ.Склад КАК Склад,
		|	ТорговоеОборудование.КассаККМ.Наименование КАК Представление
		|ИЗ
		|	РегистрСведений.ТорговоеОборудование КАК ТорговоеОборудование
		|ГДЕ
		|	ТорговоеОборудование.Компьютер = &Компьютер
		|	И ТорговоеОборудование.Подключено
		|	И ТорговоеОборудование.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыТорговогоОборудования.ККМOffline)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТорговоеОборудование.КассаККМ.Склад.Родитель,
		|	ТорговоеОборудование.КассаККМ.Склад.Наименование,
		|	ТорговоеОборудование.КассаККМ.Наименование";

	Запрос.УстановитьПараметр("Компьютер", ПолучитьСерверТО().ПолучитьИмяКомпьютераТО());
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр=Новый Структура("ОбработкаОбслуживания,КассаККМ,Склад,ID");
		ЗаполнитьЗначенияСвойств(Стр,ВыборкаДетальныеЗаписи);
		спККМOffline.Добавить(Стр,ВыборкаДетальныеЗаписи.Представление,Ложь);
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗакрытии()
	ПолучитьСерверТО().ОтключитьКлиента(ЭтаФорма);
КонецПроцедуры

Процедура УстановитьФлажкиНажатие(Элемент)
	СпККМOffline.ЗаполнитьПометки(Истина);	
КонецПроцедуры

Процедура СнятьФлажкиНажатие(Элемент)
	СпККМOffline.ЗаполнитьПометки(Ложь);
КонецПроцедуры

Процедура ККМOfflineПриАктивизацииСтроки(Элемент)
	Склад			=Элемент.ТекущаяСтрока.Значение.Склад;
	ККМOfflineID	=Элемент.ТекущаяСтрока.Значение.ID;
	ККМOffline		=РегистрыСведений.ТорговоеОборудование.Получить(Новый Структура("Идентификатор",ККМOfflineID)).Модель;
	Если Не ЗначениеЗаполнено(Склад) Тогда
		ПоказатьОповещениеПользователя("Заполните поле Склад в карточке кассы",ПолучитьНавигационнуюСсылку(Элемент.ТекущаяСтрока.Значение.КассаККМ.Ссылка),Элемент.ТекущаяСтрока.Значение.КассаККМ)
	КонецЕсли;
КонецПроцедуры

Процедура ККМOfflineВыбор(Элемент, ЭлементСписка)
	Склад			=Элемент.ТекущаяСтрока.Значение.Склад;
	ККМOfflineID	=Элемент.ТекущаяСтрока.Значение.ID;
	ККМOffline		=РегистрыСведений.ТорговоеОборудование.Получить(Новый Структура("Идентификатор",ККМOfflineID)).Модель;
	Если Не ЗначениеЗаполнено(Склад) Тогда
		ПоказатьОповещениеПользователя("Заполните поле Склад в карточке кассы",ПолучитьНавигационнуюСсылку(Элемент.ТекущаяСтрока.Значение.КассаККМ.Ссылка),Элемент.ТекущаяСтрока.Значение.КассаККМ)
	Иначе
		ОчиститьСообщения();
		Сообщить("Начало выгрузки: "+Формат(ТекущаяДата(),"ДЛФ=DT"));
		Состояние("Получение номенклатуры для выгрузки");
		
		Товары=ПолучитьТаблицуТоваровДляВыгрузки();
		Если Товары=Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Состояние("Получение цен для выгрузки");
		
		ТоварыВыгрузка=ПодготовитьТаблицуКВыгрузке(Товары,Склад,ККМOffline);
		
		Состояние("Выгрузка в кассу");
		Результат = ПолучитьСерверТО().ВыгрузитьТоварыККМ(ККМOfflineID, ТоварыВыгрузка,ТестовыйРежим,СпособВыгрузки);
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			ОписаниеРезультата = "Выгрузка завершена успешно.
			|Выгружено " + СокрЛП(ТоварыВыгрузка.Количество()) + " строк.";
		Иначе
			ОписаниеРезультата = ПолучитьСерверТО().ПолучитьТекстОшибкиККМOfflineТО(Результат);
		КонецЕсли;
		
		Состояние("");
		Сообщить("Конец выгрузки: "+Формат(ТекущаяДата(),"ДЛФ=DT"));
		ПоказатьОповещениеПользователя(ОписаниеРезультата);
	КонецЕсли;
КонецПроцедуры
//ПРОЦЕДУРЫ ОБЪЕКТОВ НА ФОРМЕ

//КНОПКИ ЗАГРУЗКИ КАСС
Процедура ОсновныеДействияФормыЗагрузитьВсеККМ(Кнопка)
//ZAM+++ 22.05.13 #1046904 Сделать загрузку товаров во все кассы по одной кнопке
    ОчиститьСообщения();
	Сообщить("ГРУППОВАЯ ВЫГРУЗКА КАСС");
	Сообщить("Начало выгрузки: "+Формат(ТекущаяДата(),"ДЛФ=DT"));
	Состояние("Получение номенклатуры для выгрузки");
	
	ТоварыКВыгрузке=ПолучитьТаблицуТоваровДляВыгрузки();
	Если ТоварыКВыгрузке=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из СпККМOffline Цикл
		Если НЕ Элемент.Пометка Тогда Продолжить; КонецЕсли;
		Если СоздаватьОповещения Тогда
			ОтправитьПисьмо(ПолучательПисем, "Выгружаем кассу "+Элемент.Представление,"");
		КонецЕсли;
		Сообщить("Обрабатываем кассу "+Элемент.Представление);
		Состояние("Получение цен для выгрузки");
		
		КассаККМ=РегистрыСведений.ТорговоеОборудование.Получить(Новый Структура("Идентификатор",Элемент.Значение.ID)).Модель;
		Товары=ПодготовитьТаблицуКВыгрузке(ТоварыКВыгрузке,Элемент.Значение.Склад,КассаККМ);
		
		Состояние("Выгрузка в кассу");
		Результат = ПолучитьСерверТО().ВыгрузитьТоварыККМ(Элемент.Значение.ID, Товары,Ложь,СпособВыгрузки);
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			ОписаниеРезультата = "Выгрузка завершена успешно.
			|Выгружено " + СокрЛП(Товары.Количество()) + " строк.";
		Иначе
			ОписаниеРезультата = ПолучитьСерверТО().ПолучитьТекстОшибкиККМOfflineТО(Результат);
		КонецЕсли;
		
		Состояние("");
	КонецЦикла;
	Сообщить("Конец выгрузки: "+Формат(ТекущаяДата(),"ДЛФ=DT"));
	Сообщить("ГРУППОВАЯ ВЫГРУЗКА КАСС ЗАВЕРШЕНА");
//ZAM--- 22.05.13
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если НЕ ЗначениеЗаполнено(ККМOffline) ИЛИ НЕ ЗначениеЗаполнено(Склад) Тогда
		Предупреждение("Касса и склад должны быть указаны",30);
		Возврат;
	КонецЕсли;
	//ОчиститьСообщения();
	//Сообщить("Начало выгрузки: "+Формат(ТекущаяДата(),"ДЛФ=DT"));
	//Состояние("Получение номенклатуры для выгрузки");
	
	Товары=ПолучитьТаблицуТоваровДляВыгрузки();
	Если Товары=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Состояние("Получение цен для выгрузки");
	
	ТоварыВыгрузка=ПодготовитьТаблицуКВыгрузке(Товары,Склад,ККМOffline);
	
	Состояние("");
	
	Построитель=Новый ПостроительОтчета;
	Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(ТоварыВыгрузка);
	ТабДок=Новый ТабличныйДокумент;
	Построитель.Вывести(ТабДок);
	ТабДок.ФиксацияСверху=4;
	ТабДок.Показать("Товары с ценами к выгрузке на кассу "+Строка(ККМOffline));
КонецПроцедуры
 
Процедура КнопкаНашиНажатие(Элемент)
	ГрСкладов=Справочники.Склады.НайтиПоКоду("000000103");
	Для Каждого Эл Из СпККМOffline Цикл
		Эл.Пометка=Эл.Значение.Склад.ПринадлежитЭлементу(ГрСкладов);
	КонецЦикла;
КонецПроцедуры
 
Процедура КнопкаФранчНажатие(Элемент)
	ГрСкладов=Справочники.Склады.НайтиПоКоду("000000103");
	Для Каждого Эл Из СпККМOffline Цикл
		Эл.Пометка=НЕ Эл.Значение.Склад.ПринадлежитЭлементу(ГрСкладов);
	КонецЦикла;
КонецПроцедуры
//КНОПКИ ЗАГРУЗКИ КАСС

//автопрогрузка 
Процедура АвтоВыгрузка(НашиМагазины=Истина) Экспорт

	//1. Только наши магазины
	Если НашиМагазины Тогда
		КнопкаНашиНажатие(Неопределено);
	Иначе
		КнопкаФранчНажатие(Неопределено);
	КонецЕсли;
	//2. Выгрузка 
	ОсновныеДействияФормыЗагрузитьВсеККМ(Неопределено);

КонецПроцедуры

СоздаватьОповещения=Ложь;
