
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТорговоеОборудование.КассаККМ,
		|	ТорговоеОборудование.Модель КАК ТО,
		|	ТорговоеОборудование.КассаККМ.Склад КАК Склад
		|ИЗ
		|	РегистрСведений.ТорговоеОборудование КАК ТорговоеОборудование
		|ГДЕ
		|	ТорговоеОборудование.Подключено
		|	И ТорговоеОборудование.КассаККМ = &КассаККМ
		|	И ТорговоеОборудование.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыТорговогоОборудования.ККМOffline)
		|	И ТорговоеОборудование.Компьютер = ""TERMINAL""";
	Запрос.УстановитьПараметр("КассаККМ",КассаККМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИТИМодуль_ВыгрузкаДанныхВКассы.РасчетДанныхДляКассы(ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры

Процедура ОсновныеДействияФормыПроверить(Кнопка)
	Набор=РегистрыСведений.ДанныеДляВыгрузкиНаКассы.СоздатьНаборЗаписей();
	Набор.Отбор.КассаККМ.Установить(КассаККМ);
	Набор.Прочитать();
	
	Рез=Набор[0].ДанныеДляВыгрузки.Получить();
	
	Построитель=Новый ПостроительОтчета;
	Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(Рез);
	ТабДок=Новый ТабличныйДокумент;
	Построитель.Вывести(ТабДок);
	ТабДок.ФиксацияСверху=4;
	ТабДок.Показать("Товары с ценами к выгрузке на кассу "+Строка(КассаККМ));
КонецПроцедуры
