////////////////////////////////////////////////////////////////////////////////////////////

Функция ПроверитьЗаполнениеРеквизитов(ОписаниеОшибки, Отказ) 
	
	Для Каждого СтрокаТабличнойЧасти Из СопоставлениеНоменклатуры Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС;
			КонецЕсли;
			
			ОписаниеОшибки = ОписаниеОшибки + "Не сопоставлена номенклатура в строке " + СтрокаТабличнойЧасти.НомерСтроки +  "!";
			
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////////////////

Процедура КнопкаСопоставитьНажатие(Кнопка)
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	
	ПроверитьЗаполнениеРеквизитов(ОписаниеОшибки, Отказ);
	
	Если Отказ Тогда
		Сообщить(ОписаниеОшибки, СтатусСообщения.ОченьВажное);
		
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Ложь);
	
КонецПроцедуры

Процедура КнопкаЗакрытьНажатие(Кнопка) 
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры