Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(ДатаНач, ?(ДатаКон='0001-01-01', ДатаКон, КонецДня(ДатаКон)));
	Если НастройкаПериода.Редактировать() Тогда
		ДатаНач = НастройкаПериода.ПолучитьДатуНачала();
		ДатаКон = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура КоманднаяПанель1Сформировать(Кнопка)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область Выборка_матрицы
	ПостроительМатрицыТочки.Выполнить();
	
	ТабМатрица=ПостроительМатрицыТочки.Результат.Выгрузить();
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ТабМатрица.КлассТорговойТочки КАК КлассТорговойТочки,
	             |	ТабМатрица.Склад КАК Склад,
	             |	ТабМатрица.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	             |	ТабМатрица.Номенклатура КАК Номенклатура,
	             |	ТабМатрица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |	ТабМатрица.Поставщик КАК Поставщик,
	             |	ТабМатрица.Количество
	             |ПОМЕСТИТЬ МатрицаТочки
	             |ИЗ
	             |	&ТабМатрица КАК ТабМатрица
	             |
	             |ИНДЕКСИРОВАТЬ ПО
	             |	КлассТорговойТочки,
	             |	Склад,
	             |	НоменклатурнаяГруппа,
	             |	Номенклатура,
	             |	ХарактеристикаНоменклатуры,
	             |	Поставщик";
	Запрос.УстановитьПараметр("ТабМатрица",ТабМатрица);
	Запрос.Выполнить();
#КонецОбласти
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));	
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("ЛокальныйЗаказ", ЛокальныйЗаказ);
	Запрос.УстановитьПараметр("ОптовыйСклад", ОптовыйСклад);
	НомДеньНедели = ДеньНедели(ДатаКон)+2-1;
	Если НомДеньНедели>6 Тогда
		НомДеньНедели = НомДеньНедели - 7;
	КонецЕсли;
	Запрос.УстановитьПараметр("ДеньНедели", Перечисления.ДниНедели.Получить(НомДеньНедели));
	Запрос.Текст =
#Область Большой_и_старшный_запрос
	"ВЫБРАТЬ
	|	МатрицаТочки.КлассТорговойТочки,
	|	МатрицаТочки.Склад,
	|	МатрицаТочки.НоменклатурнаяГруппа,
	|	МатрицаТочки.Номенклатура,
	|	МатрицаТочки.ХарактеристикаНоменклатуры,
	|	МатрицаТочки.Поставщик,
	|	ЕСТЬNULL(МатрицаСкладаСрезПоследних.Количество, МатрицаТочки.Количество) КАК Количество
	|ПОМЕСТИТЬ ТабМатрица
	|ИЗ
	|	МатрицаТочки КАК МатрицаТочки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МатрицаСклада.СрезПоследних КАК МатрицаСкладаСрезПоследних
	|		ПО МатрицаТочки.Склад = МатрицаСкладаСрезПоследних.Склад
	|			И МатрицаТочки.Номенклатура = МатрицаСкладаСрезПоследних.Номенклатура
	|			И МатрицаТочки.ХарактеристикаНоменклатуры = МатрицаСкладаСрезПоследних.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ЕСТЬNULL(МатрицаСкладаСрезПоследних.Количество, МатрицаТочки.Количество) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МатрицаТочки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	СУММА(ВложенныйЗапрос.Наличие) КАК КоличествоДнейПродаж
	|ПОМЕСТИТЬ ТабДнейПродаж
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад КАК Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура КАК Номенклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Наличие
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата1,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата2,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата3,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата4,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата5,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата6,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата7,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата8,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата9,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата10,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата11,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата12,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата13,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата14,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата15,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата16,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата17,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата18,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата19,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата20,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата21,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата22,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата23,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата24,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата25,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата26,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата27,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	|					&Дата28,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ПО ТабМатрица.Склад = ТоварыВРозницеОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыВРозницеОстатки.Склад,
	|		ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыВРозницеОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата1,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата2,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата3,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата4,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата5,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата6,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата7,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата8,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата9,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата10,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата11,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата12,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата13,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата14,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата15,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата16,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата17,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата18,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата19,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата20,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата21,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата22,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата23,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата24,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата25,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата26,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата27,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|					&Дата28,
	|					Номенклатура.ГоловнаяНоменклатура В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Номенклатура
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)
	|						И Склад В
	|							(ВЫБРАТЬ
	|								ТабМатрица.Склад
	|							ИЗ
	|								ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ПО ТабМатрица.Склад = ТоварыНаСкладахОстатки.Склад
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыНаСкладахОстатки.Склад,
	|		ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура,
	|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры";
	Для Сч = 1 По 28 Цикл
		Запрос.УстановитьПараметр("Дата"+Сч, КонецДня(ДатаНач+(Сч-1)*24*3600));
	КонецЦикла;
#КонецОбласти
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	СУММА(ВложенныйЗапрос.КоличествоПродажа) КАК КоличествоПродажа
	|ПОМЕСТИТЬ ТабПродажи
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|					ИЛИ ПродажиОбороты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|				ТОГДА ПродажиОбороты.Регистратор.Склад
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		КОНЕЦ КАК Склад,
	|		ТабМатрица.Номенклатура КАК Номенклатура,
	|		ТабМатрица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА &ЛокальныйЗаказ
	|				ТОГДА ПродажиОбороты.КоличествоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоПродажа
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
	|					&ДатаНач,
	|					&ДатаКон,
	|					Регистратор,
	|					Номенклатура.ГоловнаяНоменклатура В
	|						(ВЫБРАТЬ
	|							ТабМатрица.Номенклатура
	|						ИЗ
	|							ТабМатрица КАК ТабМатрица)) КАК ПродажиОбороты
	|			ПО (ТабМатрица.Склад = ВЫБОР
	|					КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|							ИЛИ ПродажиОбороты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|						ТОГДА ПродажиОбороты.Регистратор.Склад
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				КОНЕЦ)
	|				И ТабМатрица.ХарактеристикаНоменклатуры = ПродажиОбороты.ХарактеристикаНоменклатуры
	|				И ТабМатрица.Номенклатура = ПродажиОбороты.Номенклатура.ГоловнаяНоменклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Склад,
	|		ТабМатрица.Номенклатура,
	|		ТабМатрица.ХарактеристикаНоменклатуры,
	|		ВЫБОР
	|			КОГДА &ЛокальныйЗаказ
	|				ТОГДА 0
	|			ИНАЧЕ ТоварыНаСкладахОбороты.КоличествоРасход
	|		КОНЕЦ
	|	ИЗ
	|		ТабМатрица КАК ТабМатрица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Обороты(
	|					&ДатаНач,
	|					&ДатаКон,
	|					Регистратор,
	|					Номенклатура.ГоловнаяНоменклатура В
	|						(ВЫБРАТЬ
	|							ТабМатрица.Номенклатура
	|						ИЗ
	|							ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОбороты
	|			ПО ТабМатрица.ХарактеристикаНоменклатуры = ТоварыНаСкладахОбороты.ХарактеристикаНоменклатуры
	|				И ТабМатрица.Номенклатура = ТоварыНаСкладахОбороты.Номенклатура.ГоловнаяНоменклатура
	|				И ТабМатрица.Склад = ТоварыНаСкладахОбороты.Склад) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ТабОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабМатрица.Склад КАК Склад,
	|		ТабМатрица.Номенклатура КАК Номенклатура,
	|		ТабМатрица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ТоварыВРозницеОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыВРознице.Остатки(
	|				&ДатаКон,
	|				Номенклатура.ГоловнаяНоменклатура В
	|						(ВЫБРАТЬ
	|							ТабМатрица.Номенклатура
	|						ИЗ
	|							ТабМатрица КАК ТабМатрица)
	|					И Склад В
	|						(ВЫБРАТЬ
	|							ТабМатрица.Склад
	|						ИЗ
	|							ТабМатрица КАК ТабМатрица)) КАК ТоварыВРозницеОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабМатрица КАК ТабМатрица
	|			ПО ТоварыВРозницеОстатки.Склад = ТабМатрица.Склад
	|				И ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры = ТабМатрица.ХарактеристикаНоменклатуры
	|				И ТоварыВРозницеОстатки.Номенклатура.ГоловнаяНоменклатура = ТабМатрица.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТабМатрица.Склад,
	|		ТабМатрица.Номенклатура,
	|		ТабМатрица.ХарактеристикаНоменклатуры,
	|		ТоварыНаСкладахОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&ДатаКон,
	|				Номенклатура.ГоловнаяНоменклатура В
	|						(ВЫБРАТЬ
	|							ТабМатрица.Номенклатура
	|						ИЗ
	|							ТабМатрица КАК ТабМатрица)
	|					И Склад В
	|						(ВЫБРАТЬ
	|							ТабМатрица.Склад
	|						ИЗ
	|							ТабМатрица КАК ТабМатрица)) КАК ТоварыНаСкладахОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабМатрица КАК ТабМатрица
	|			ПО ТоварыНаСкладахОстатки.Склад = ТабМатрица.Склад
	|				И ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ТабМатрица.ХарактеристикаНоменклатуры
	|				И ТоварыНаСкладахОстатки.Номенклатура.ГоловнаяНоменклатура = ТабМатрица.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТабМатрица.Склад,
	|		ТабМатрица.Номенклатура,
	|		ТабМатрица.ХарактеристикаНоменклатуры,
	|		-1 * ВЫБОР
	|			КОГДА &ЛокальныйЗаказ
	|				ТОГДА 0
	|			ИНАЧЕ ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(
	|				&ДатаКон,
	|				Номенклатура.ГоловнаяНоменклатура В
	|						(ВЫБРАТЬ
	|							ТабМатрица.Номенклатура
	|						ИЗ
	|							ТабМатрица КАК ТабМатрица)
	|					И Склад В
	|						(ВЫБРАТЬ
	|							ТабМатрица.Склад
	|						ИЗ
	|							ТабМатрица КАК ТабМатрица)) КАК ТоварыКПередачеСоСкладовОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабМатрица КАК ТабМатрица
	|			ПО ТоварыКПередачеСоСкладовОстатки.Склад = ТабМатрица.Склад
	|				И ТоварыКПередачеСоСкладовОстатки.ХарактеристикаНоменклатуры = ТабМатрица.ХарактеристикаНоменклатуры
	|				И ТоварыКПередачеСоСкладовОстатки.Номенклатура.ГоловнаяНоменклатура = ТабМатрица.Номенклатура) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабМатрица.Склад,
	|	ТабМатрица.Номенклатура,
	|	ТабМатрица.ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ПОМЕСТИТЬ ТабЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаКон,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ТабМатрица.Номенклатура
	|				ИЗ
	|					ТабМатрица КАК ТабМатрица)) КАК ЦеныНоменклатурыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабМатрица КАК ТабМатрица
	|		ПО (ТабМатрица.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры)
	|			И (ТабМатрица.Склад.ТипЦенРозничнойТорговли = ЦеныНоменклатурыСрезПоследних.ТипЦен)
	|			И (ТабМатрица.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура.ГоловнаяНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабМатрица.КлассТорговойТочки,
	|	ТабМатрица.Склад,
	|	ТабМатрица.НоменклатурнаяГруппа,
	|	ТабМатрица.Номенклатура,
	|	1 КАК КоэффициентПлана
	|ПОМЕСТИТЬ ТабКоэффициентПлана
	|ИЗ
	|	ТабМатрица КАК ТабМатрица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабМатрица.НоменклатурнаяГруппа,
	|	ТабМатрица.Номенклатура,
	|	1 КАК КоэффициентСпроса
	|ПОМЕСТИТЬ ТабКоэффициентСпроса
	|ИЗ
	|	ТабМатрица КАК ТабМатрица
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабМатрица.НоменклатурнаяГруппа,
	|	ТабМатрица.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоэффициентыДняНеделиСрезПоследних.Коэффициент КАК КоэффициентДеньНедели
	|ПОМЕСТИТЬ ТабКоэффициентДеньНедели
	|ИЗ
	|	РегистрСведений.КоэффициентыДняНедели.СрезПоследних(&ДатаКон, ДеньНедели = &ДеньНедели) КАК КоэффициентыДняНеделиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабМатрица.КлассТорговойТочки,
	|	ТабМатрица.Номенклатура,
	|	ТабМатрица.ХарактеристикаНоменклатуры,
	|	КоэффициентыАВССрезПоследних.Коэффициент КАК КоэффициентАВС
	|ПОМЕСТИТЬ ТабКоэффициентАВС
	|ИЗ
	|	ТабМатрица КАК ТабМатрица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ABCКлассификацияТовараПоТорговымТочкам.СрезПоследних КАК ABCКлассификацияТовараПоТорговымТочкамСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентыАВС.СрезПоследних КАК КоэффициентыАВССрезПоследних
	|			ПО (КоэффициентыАВССрезПоследних.КлассАВС = ABCКлассификацияТовараПоТорговымТочкамСрезПоследних.КлассABC)
	|		ПО ТабМатрица.КлассТорговойТочки = ABCКлассификацияТовараПоТорговымТочкамСрезПоследних.КлассТорговойТочки
	|			И ТабМатрица.Номенклатура = ABCКлассификацияТовараПоТорговымТочкамСрезПоследних.Номенклатура
	|			И ТабМатрица.ХарактеристикаНоменклатуры = ABCКлассификацияТовараПоТорговымТочкамСрезПоследних.ХарактеристикаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабМатрица.КлассТорговойТочки,
	|	ТабМатрица.Номенклатура,
	|	ТабМатрица.ХарактеристикаНоменклатуры,
	|	КоэффициентыАВССрезПоследних.Коэффициент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабМатрица.Номенклатура.Код КАК КодТовара,
	|	ТабМатрица.Номенклатура.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТабПродажи.КоличествоПродажа, 0) КАК ЧИСЛО(15, 3)) КАК ПродажаЗаЧетыреНедели,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТабДнейПродаж.КоличествоДнейПродаж, 0) КАК ЧИСЛО(15, 1)) КАК ДнейПродаж,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТабДнейПродаж.КоличествоДнейПродаж, 0) = 0
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ТабПродажи.КоличествоПродажа, 0) / ТабДнейПродаж.КоличествоДнейПродаж
	|		КОНЕЦ КАК ЧИСЛО(15, 3)) КАК СреднедневныеПродажи,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТабОстатки.КоличествоОстаток, 0) КАК ЧИСЛО(15, 3)) КАК Остаток,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ТабДнейПродаж.КоличествоДнейПродаж, 0) = 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(ТабПродажи.КоличествоПродажа, 0) / ТабДнейПродаж.КоличествоДнейПродаж
	|				КОНЕЦ = 0
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ТабОстатки.КоличествоОстаток, 0) / ВЫБОР
	|					КОГДА ЕСТЬNULL(ТабДнейПродаж.КоличествоДнейПродаж, 0) = 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(ТабПродажи.КоличествоПродажа, 0) / ТабДнейПродаж.КоличествоДнейПродаж
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 1)) КАК ОстатокДнейСУчетомМинимальногоЗапаса,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 3)) КАК РасчетныйЗаказ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 3)) КАК ЗаказЕд,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 3)) КАК ЗаказУп,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА &ЛокальныйЗаказ
	|				ТОГДА ЕСТЬNULL(ТабМатрица.Номенклатура.МинимальныйКвантОтгрузки, 1)
	|			ИНАЧЕ ЕСТЬNULL(ТабМатрица.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент, 1)
	|		КОНЕЦ КАК ЧИСЛО(15, 3)) КАК КоличествоШтукВУпаковке,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 1)) КАК ОстатокДнейСУчетомЗаказа,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТабМатрица.Количество, 0) КАК ЧИСЛО(15, 3)) КАК МинимальныйОстаток,
	|	ТабМатрица.Склад КАК Склад,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТабЦены.Цена, 0) КАК ЧИСЛО(15, 2)) КАК Цена,
	|	ВЫБОР
	|		КОГДА &ЛокальныйЗаказ
	|			ТОГДА &ОптовыйСклад
	|		ИНАЧЕ 
	//|			ВЫБОР
	//|				КОГДА ТабМатрица.Поставщик1 <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ТабМатрица.Поставщик1
	//|				ИНАЧЕ ТабМатрица.Поставщик2
	//|			КОНЕЦ
	|			ТабМатрица.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ВЫРАЗИТЬ(1 КАК ЧИСЛО(15, 3)) КАК КоэффициентПлана,
	|	ВЫРАЗИТЬ(1 КАК ЧИСЛО(15, 3)) КАК КоэффициентСпроса,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТабКоэффициентДеньНедели.КоэффициентДеньНедели, 1) КАК ЧИСЛО(15, 3)) КАК КоэффициентДеньНедели,
	|	ТабМатрица.КлассТорговойТочки КАК КлассТорговойТочки,
	|	ТабМатрица.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ТабМатрица.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТабКоэффициентАВС.КоэффициентАВС, 1) КАК ЧИСЛО(15, 3)) КАК КоэффициентАВС
	|ИЗ
	|	ТабМатрица КАК ТабМатрица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПродажи КАК ТабПродажи
	|		ПО ТабМатрица.Склад = ТабПродажи.Склад
	|			И ТабМатрица.Номенклатура = ТабПродажи.Номенклатура
	|			И ТабМатрица.ХарактеристикаНоменклатуры = ТабПродажи.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабДнейПродаж КАК ТабДнейПродаж
	|		ПО ТабМатрица.Склад = ТабДнейПродаж.Склад
	|			И ТабМатрица.Номенклатура = ТабДнейПродаж.Номенклатура
	|			И ТабМатрица.ХарактеристикаНоменклатуры = ТабДнейПродаж.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабОстатки КАК ТабОстатки
	|		ПО ТабМатрица.Склад = ТабОстатки.Склад
	|			И ТабМатрица.Номенклатура = ТабОстатки.Номенклатура
	|			И ТабМатрица.ХарактеристикаНоменклатуры = ТабОстатки.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦены КАК ТабЦены
	|		ПО ТабМатрица.Склад = ТабЦены.Склад
	|			И ТабМатрица.Номенклатура = ТабЦены.Номенклатура
	|			И ТабМатрица.ХарактеристикаНоменклатуры = ТабЦены.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабКоэффициентСпроса КАК ТабКоэффициентСпроса
	|		ПО ТабМатрица.НоменклатурнаяГруппа = ТабКоэффициентСпроса.НоменклатурнаяГруппа
	|			И ТабМатрица.Номенклатура = ТабКоэффициентСпроса.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабКоэффициентПлана КАК ТабКоэффициентПлана
	|		ПО ТабМатрица.КлассТорговойТочки = ТабКоэффициентПлана.КлассТорговойТочки
	|			И ТабМатрица.Склад = ТабКоэффициентПлана.Склад
	|			И ТабМатрица.НоменклатурнаяГруппа = ТабКоэффициентПлана.НоменклатурнаяГруппа
	|			И ТабМатрица.Номенклатура = ТабКоэффициентПлана.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабКоэффициентАВС КАК ТабКоэффициентАВС
	|		ПО ТабМатрица.КлассТорговойТочки = ТабКоэффициентАВС.КлассТорговойТочки
	|			И ТабМатрица.Номенклатура = ТабКоэффициентАВС.Номенклатура
	|			И ТабМатрица.ХарактеристикаНоменклатуры = ТабКоэффициентАВС.ХарактеристикаНоменклатуры,
	|	ТабКоэффициентДеньНедели КАК ТабКоэффициентДеньНедели";
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЭлементыФормы.Результат.СоздатьКолонки();
	ЭлементыФормы.Результат.Колонки.Найти("КлассТорговойТочки").Видимость   = Ложь;
	ЭлементыФормы.Результат.Колонки.Найти("НоменклатурнаяГруппа").Видимость = Ложь;
	ЭлементыФормы.Результат.Колонки.Найти("Номенклатура").Видимость         = Ложь;
	ЭлементыФормы.Результат.Колонки.Найти("КоэффициентАВС").Видимость       = Ложь;
	//причесон таблицы
	ЭлементыФормы.Результат.Колонки.Найти("КодТовара").Ширина = 16;
	ЭлементыФормы.Результат.Колонки.Найти("Наименование").АвтоВысотаЯчейки = Истина;
	ЭлементыФормы.Результат.Колонки.Найти("Наименование").ВысотаЯчейки = 3;
	ЭлементыФормы.Результат.Колонки.Найти("Наименование").Ширина = 56;
	ЭлементыФормы.Результат.Колонки.Найти("Наименование").ВысотаЯчейки = 2;
	ЭлементыФормы.Результат.Колонки.Найти("ПродажаЗаЧетыреНедели").Ширина = 15;
	ЭлементыФормы.Результат.Колонки.Найти("ДнейПродаж").Ширина= 13;
	ЭлементыФормы.Результат.Колонки.Найти("СреднедневныеПродажи").Ширина = 13;
	ЭлементыФормы.Результат.Колонки.Найти("Остаток").Ширина = 13;
	ЭлементыФормы.Результат.Колонки.Найти("ОстатокДнейСУчетомМинимальногоЗапаса").Ширина = 13;
	ЭлементыФормы.Результат.Колонки.Найти("РасчетныйЗаказ").Ширина = 13;
	ЭлементыФормы.Результат.Колонки.Найти("ЗаказЕд").Ширина = 13;
	ЭлементыФормы.Результат.Колонки.Найти("ЗаказУп").Ширина = 13;
	ЭлементыФормы.Результат.Колонки.Найти("КоличествоШтукВУпаковке").Ширина = 13;
	ЭлементыФормы.Результат.Колонки.Найти("ОстатокДнейСУчетомЗаказа").Ширина = 13;
	ЭлементыФормы.Результат.Колонки.Найти("Цена").Ширина = 13;
	ЭлементыФормы.Результат.Колонки.Найти("Поставщик").Ширина = 32;
	ЭлементыФормы.Результат.Колонки.Найти("КоэффициентПлана").Ширина = 10;
	ЭлементыФормы.Результат.Колонки.Найти("КоэффициентСпроса").Ширина = 10;
	ЭлементыФормы.Результат.Колонки.Найти("КоэффициентДеньНедели").Ширина = 10;
	ЭлементыФормы.Результат.Колонки.Найти("МинимальныйОстаток").Ширина = 10;
	ЭлементыФормы.Результат.Колонки.Найти("Склад").Ширина = 11;
	
	Для Каждого СтрокаТЗ Из Результат Цикл
		//Пропишем коэффициенты в уже готовую таблицу. В таблице все коэффиценты уже установлены по умолчанию
		//Получим коэффициент спроса
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КоэффициентыСпросаСрезПоследних.НоменклатурнаяГруппа,
		|	КоэффициентыСпросаСрезПоследних.Номенклатура,
		|	КоэффициентыСпросаСрезПоследних.Коэффициент
		|ИЗ
		|	РегистрСведений.КоэффициентыСпроса.СрезПоследних(
		|			&ДатаКон,
		|			НоменклатурнаяГруппа = &НоменклатурнаяГруппа
		|				ИЛИ Номенклатура = &Номенклатура) КАК КоэффициентыСпросаСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА КоэффициентыСпросаСрезПоследних.Номенклатура = &Номенклатура
		|					ИЛИ КоэффициентыСпросаСрезПоследних.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА КоэффициентыСпросаСрезПоследних.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
		|					ИЛИ КоэффициентыСпросаСрезПоследних.НоменклатурнаяГруппа = ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа", СтрокаТЗ.НоменклатурнаяГруппа);
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТЗ.Номенклатура);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество()>0 Тогда
			Рез.Сортировать("Номенклатура Убыв, НоменклатурнаяГруппа Убыв");
			СтрокаТЗ.КоэффициентСпроса = Рез[0].Коэффициент;
		КонецЕсли;
		
		//Получим коэффициент плана
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КоэффициентыПланаСрезПоследних.КлассТорговойТочки,
		|	КоэффициентыПланаСрезПоследних.Склад,
		|	КоэффициентыПланаСрезПоследних.НоменклатурнаяГруппа,
		|	КоэффициентыПланаСрезПоследних.Номенклатура,
		|	КоэффициентыПланаСрезПоследних.Коэффициент
		|ИЗ
		|	РегистрСведений.КоэффициентыПлана.СрезПоследних(
		|			&ДатаКон,
		|			КлассТорговойТочки = &КлассТорговойТочки
		|				ИЛИ Склад = &Склад
		|				ИЛИ НоменклатурнаяГруппа = &НоменклатурнаяГруппа
		|				ИЛИ Номенклатура = &Номенклатура) КАК КоэффициентыПланаСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА КоэффициентыПланаСрезПоследних.Номенклатура = &Номенклатура
		|					ИЛИ КоэффициентыПланаСрезПоследних.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА КоэффициентыПланаСрезПоследних.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
		|					ИЛИ КоэффициентыПланаСрезПоследних.НоменклатурнаяГруппа = ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА КоэффициентыПланаСрезПоследних.Склад = &Склад
		|					ИЛИ КоэффициентыПланаСрезПоследних.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА КоэффициентыПланаСрезПоследних.КлассТорговойТочки = &КлассТорговойТочки
		|					ИЛИ КоэффициентыПланаСрезПоследних.КлассТорговойТочки = ЗНАЧЕНИЕ(Справочник.КлассыТорговойТочки.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("КлассТорговойТочки", СтрокаТЗ.КлассТорговойТочки);
		Запрос.УстановитьПараметр("Склад", СтрокаТЗ.Склад);
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа", СтрокаТЗ.НоменклатурнаяГруппа);
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТЗ.Номенклатура);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество()>0 Тогда
			Рез.Сортировать("Номенклатура Убыв, НоменклатурнаяГруппа Убыв, Склад Убыв, КлассТорговойТочки Убыв");
			СтрокаТЗ.КоэффициентПлана = Рез[0].Коэффициент;
		КонецЕсли;
		
		//дозаполним расчетные колонки
		СтрокаТЗ.РасчетныйЗаказ = СтрокаТЗ.МинимальныйОстаток+((СтрокаТЗ.СреднедневныеПродажи*ПериодЗаказа* СтрокаТЗ.КоэффициентПлана*СтрокаТЗ.КоэффициентСпроса*СтрокаТЗ.КоэффициентДеньНедели*СтрокаТЗ.КоэффициентАВС)-СтрокаТЗ.Остаток);
		Квант = СтрокаТЗ.КоличествоШтукВУпаковке;
		Если СтрокаТЗ.РасчетныйЗаказ>0 Тогда
			КолКвантов = Цел(СтрокаТЗ.РасчетныйЗаказ/Квант);
			Если КолКвантов*Квант<СтрокаТЗ.РасчетныйЗаказ Тогда
				СтрокаТЗ.ЗаказЕд = (КолКвантов+1)*Квант;
			Иначе
				СтрокаТЗ.ЗаказЕд = КолКвантов*Квант;
			КонецЕсли;
		Иначе
			СтрокаТЗ.ЗаказЕд = 0;
		КонецЕсли;
		СтрокаТЗ.ЗаказУп = СтрокаТЗ.ЗаказЕд/Квант;
		Если СтрокаТЗ.СреднедневныеПродажи<>0 Тогда
			СтрокаТЗ.ОстатокДнейСУчетомЗаказа = Окр((СтрокаТЗ.Остаток+СтрокаТЗ.ЗаказЕд)/СтрокаТЗ.СреднедневныеПродажи,1);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура КоманднаяПанель1УстановитьКоэфиценты(Кнопка)

	СпКоэффициентов = Новый СписокЗначений;
	СпКоэффициентов.Добавить("КоэффициентыПлана", "Коэффициенты плана");
	СпКоэффициентов.Добавить("КоэффициентыСпроса", "Коэффициенты спроса");
	СпКоэффициентов.Добавить("КоэффициентыДняНедели", "Коэффициенты дня недели");
	СпКоэффициентов.Добавить("КоэффициентыАВС", "Коэффициенты АВС");
	ВыбЭл = СпКоэффициентов.ВыбратьЭлемент();
	Если ВыбЭл<>Неопределено Тогда
		Форма = Получитьформу("РегистрСведений."+ВыбЭл.Значение+".ФормаСписка");
		Форма.Открыть();
	КонецЕсли;

КонецПроцедуры

Процедура КоманднаяПанель1СформироватьЗаказы(Кнопка)

	Если ЛокальныйЗаказ Тогда
		СоздатьДокументыВнутреннийЗаказ();
	Иначе
		СоздатьДокументыЗаказПоставщику();
	КонецЕсли;

КонецПроцедуры

Процедура ДатаКонПриИзменении(Элемент)

	ДатаНач = ДатаКон-27*24*3600;

КонецПроцедуры

Процедура СоздатьДокументыВнутреннийЗаказ_old()

	ТабДок = Новый ТаблицаЗначений;
	ТабДок.Колонки.Добавить("Склад");
	ТабДок.Колонки.Добавить("Док");
	Для Каждого СтрокаТЗ Из Результат Цикл
		Если ТабДок.Найти(СтрокаТЗ.Склад, "Склад")=Неопределено Тогда
			НовСтр = ТабДок.Добавить();
			НовСтр.Склад = СтрокаТЗ.Склад;
			НовСтр.Док   = Документы.ВнутреннийЗаказ.СоздатьДокумент();
			НовСтр.Док.Дата                 = ТекущаяДата();
			НовСтр.Док.Ответственный        = ПараметрыСеанса.ТекущийПользователь;
			НовСтр.Док.ВидЗаказа            = Перечисления.ВидыВнутреннегоЗаказа.НаСклад;
			НовСтр.Док.Заказчик             = СтрокаТЗ.Склад;
			НовСтр.Док.Организация          = НовСтр.Док.Заказчик.Организация;
			НовСтр.Док.ДатаОтгрузки         = ТекущаяДата()+24*3600;//завтра
			НовСтр.Док.Подразделение        = СтрокаТЗ.Склад.Подразделение;
			НовСтр.Док.ВидЗаказанногоТовара = Строка(СтрокаТЗ.НоменклатурнаяГруппа);
			НовСтр.Док.Комментарий          = "Создан автоматически обработкой формирование заказов в "+ТекущаяДата();
		КонецЕсли;
	КонецЦикла;
	ТабДок.Сортировать("Склад");
	
	Для Каждого СтрокаДок Из ТабДок Цикл
		МассивСтрок = Результат.НайтиСтроки(Новый Структура("Склад", СтрокаДок.Склад));
		Для Каждого СтрокаТЗ Из МассивСтрок Цикл
			Если СтрокаТЗ.ЗаказЕд>0 Тогда
				НовСтр = СтрокаДок.Док.Товары.Добавить();
				НовСтр.Количество   = СтрокаТЗ.ЗаказЕд;
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ТоварыНаСкладахОстатки.Номенклатура,
				|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК Остаток
				|ИЗ
				|	РегистрНакопления.ТоварыНаСкладах.Остатки(
				|			&ДатаКон,
				|			Номенклатура.ГоловнаяНоменклатура = &Номенклатура
				|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
				|
				|СГРУППИРОВАТЬ ПО
				|	ТоварыНаСкладахОстатки.Номенклатура
				|
				|УПОРЯДОЧИТЬ ПО
				|	Остаток
				|АВТОУПОРЯДОЧИВАНИЕ";
				Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
				Запрос.УстановитьПараметр("Склад", ОптовыйСклад);
				Запрос.УстановитьПараметр("Номенклатура", СтрокаТЗ.Номенклатура);
				Остатки = Запрос.Выполнить().Выгрузить();
				Если Остатки.Количество()>0 Тогда
					НовСтр.Номенклатура = Остатки[0].Номенклатура;
				Иначе
					НовСтр.Номенклатура = СтрокаТЗ.Номенклатура;
				КонецЕсли;
				ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НовСтр, СтрокаДок.Док);
				ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуТабЧасти(НовСтр, СтрокаДок.Док); 
			КонецЕсли;
		КонецЦикла;
		СтрокаДок.Док.Записать(РежимЗаписиДокумента.Запись);
		Форма = СтрокаДок.Док.ПолучитьФорму();
		Форма.Открыть();
	КонецЦикла;

КонецПроцедуры

Процедура СоздатьДокументыВнутреннийЗаказ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			&ДатаКон,
	               |			Номенклатура.ГоловнаяНоменклатура В (&Номенклатура)
	               |				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыНаСкладахОстатки.Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Склад", ОптовыйСклад);
	Запрос.УстановитьПараметр("Номенклатура", ИТИИндустрияОбщийМодульКлиентСервер.ЗаполнитьМассивУникальнымиЗначениями(Результат.ВыгрузитьКолонку("Номенклатура"),Истина));
	ТаблицаНаличие=Запрос.Выполнить().Выгрузить();
	ТаблицаНаличие.Индексы.Добавить("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРезультат.Склад,
		|	ТаблицаРезультат.НоменклатурнаяГруппа,
		|	ТаблицаРезультат.Номенклатура,
		|	ТаблицаРезультат.ЗаказЕд
		|ПОМЕСТИТЬ ВТ_Результат
		|ИЗ
		|	&ТаблицаРезультат КАК ТаблицаРезультат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Результат.Склад КАК Склад,
		|	ВТ_Результат.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	ВТ_Результат.Номенклатура,
		|	ВТ_Результат.ЗаказЕд
		|ИЗ
		|	ВТ_Результат КАК ВТ_Результат
		|ИТОГИ ПО
		|	Склад,
		|	НоменклатурнаяГруппа";
	Запрос.УстановитьПараметр("ТаблицаРезультат",Результат);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
		// Вставить обработку выборки ВыборкаСклад
	
		ВыборкаНоменклатурнаяГруппа = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаНоменклатурнаяГруппа.Следующий() Цикл
			// Вставить обработку выборки ВыборкаНоменклатурнаяГруппа
	        Док   = Документы.ВнутреннийЗаказ.СоздатьДокумент();
			Док.Дата                 = ТекущаяДата();
			Док.Ответственный        = ПараметрыСеанса.ТекущийПользователь;
			Док.ВидЗаказа            = Перечисления.ВидыВнутреннегоЗаказа.НаСклад;
			Док.Заказчик             = ВыборкаНоменклатурнаяГруппа.Склад;
			Док.Организация          = ВыборкаНоменклатурнаяГруппа.Организация;
			Док.ДатаОтгрузки         = ТекущаяДата()+24*3600;//завтра
			Док.Подразделение        = ВыборкаНоменклатурнаяГруппа.Склад.Подразделение;
			Док.ВидЗаказанногоТовара = Строка(ВыборкаНоменклатурнаяГруппа.НоменклатурнаяГруппа);
			Док.Комментарий          = "Создан автоматически обработкой формирование заказов в "+ТекущаяДата();
			ВыборкаДетальныеЗаписи = ВыборкаНоменклатурнаяГруппа.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.ЗаказЕд>0 Тогда
					НовСтр = Док.Товары.Добавить();
					НовСтр.Количество   = ВыборкаДетальныеЗаписи.ЗаказЕд;
					Остатки = ТаблицаНаличие.Найти(ВыборкаДетальныеЗаписи.Номенклатура,"Номенклатура");
					Если Остатки<>Неопределено Тогда
						НовСтр.Номенклатура = Остатки[0].Номенклатура;
					Иначе
						НовСтр.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					КонецЕсли;
					ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НовСтр, Док);
					ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуТабЧасти(НовСтр, Док); 
				КонецЕсли;
			КонецЦикла;
			Док.ПолучитьФорму().Открыть();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура СоздатьДокументыЗаказПоставщику()

	ТабДок = Новый ТаблицаЗначений;
	ТабДок.Колонки.Добавить("Поставщик");
	ТабДок.Колонки.Добавить("Док");
	Для Каждого СтрокаТЗ Из Результат Цикл
		Если ТабДок.Найти(СтрокаТЗ.Поставщик, "Поставщик")=Неопределено Тогда
			КонтрагентДок         = СтрокаТЗ.Поставщик;
			ДоговорКонтрагентаДок = КонтрагентДок.ОсновнойДоговорКонтрагента;
//ZAM+++ 19.10.2015 #1191811 инструменты управления фирмами
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
			|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.ПоставщикБух = &ПоставщикБух";
			Запрос.УстановитьПараметр("ПоставщикБух", КонтрагентДок);
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				КонтрагентДок         = Выборка.Контрагент;
				ДоговорКонтрагентаДок = Выборка.ДоговорКонтрагента; 
			КонецЕсли;
//ZAM--- 19.10.2015
			НовСтр = ТабДок.Добавить();
			НовСтр.Поставщик = СтрокаТЗ.Поставщик;
			НовСтр.Док       = Документы.ЗаказПоставщику.СоздатьДокумент();
			НовСтр.Док.Дата               = ТекущаяДата();
			НовСтр.Док.Ответственный      = ПараметрыСеанса.ТекущийПользователь;
			НовСтр.Док.Контрагент         = КонтрагентДок;
			НовСтр.Док.ДоговорКонтрагента = ДоговорКонтрагентаДок;
			НовСтр.Док.Организация        = НовСтр.Док.ДоговорКонтрагента.Организация;
			НовСтр.Док.ДатаОплаты         = ТекущаяДата()+24*3600;//завтра
			НовСтр.Док.ДатаПоступления    = НовСтр.Док.ДатаОплаты;
			НовСтр.Док.Комментарий        = "Создан автоматически обработкой формирование заказов в "+ТекущаяДата();
			НовСтр.Док.Склад              = СтрокаТЗ.Склад;
			СтруктураРеквизитовДокумента  = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ЭтотОбъект);
            ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(НовСтр.Док, НовСтр.Док.ДоговорКонтрагента.ВалютаВзаиморасчетов, глЗначениеПеременной("ВалютаРегламентированногоУчета"), Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов, СтруктураРеквизитовДокумента, "Покупка", "Товары", НовСтр.Док.ДоговорКонтрагента);
			НовСтр.Док.ТипЦен             = НовСтр.Док.ДоговорКонтрагента.ТипЦен;
			НовСтр.Док.Подразделение      = "";
		КонецЕсли;
	КонецЦикла;
	ТабДок.Сортировать("Поставщик");
	
	Для Каждого СтрокаДок Из ТабДок Цикл
		МассивСтрок = Результат.НайтиСтроки(Новый Структура("Поставщик", СтрокаДок.Поставщик));
		Для Каждого СтрокаТЗ Из МассивСтрок Цикл
			Если СтрокаТЗ.ЗаказЕд>0 Тогда
				НовСтр = СтрокаДок.Док.Товары.Добавить();
				НовСтр.Количество   = СтрокаТЗ.ЗаказЕд;
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ТоварыНаСкладахОстатки.Номенклатура,
				|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК Остаток
				|ИЗ
				|	РегистрНакопления.ТоварыНаСкладах.Остатки(
				|			&ДатаКон,
				|			Номенклатура.ГоловнаяНоменклатура = &Номенклатура
				|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
				|
				|СГРУППИРОВАТЬ ПО
				|	ТоварыНаСкладахОстатки.Номенклатура
				|
				|УПОРЯДОЧИТЬ ПО
				|	Остаток
				|АВТОУПОРЯДОЧИВАНИЕ";
				Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
				Запрос.УстановитьПараметр("Склад", ОптовыйСклад);
				Запрос.УстановитьПараметр("Номенклатура", СтрокаТЗ.Номенклатура);
				Остатки = Запрос.Выполнить().Выгрузить();
				Если Остатки.Количество()>0 Тогда
					НовСтр.Номенклатура = Остатки[0].Номенклатура;
				Иначе
					НовСтр.Номенклатура = СтрокаТЗ.Номенклатура;
				КонецЕсли;
				ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НовСтр, СтрокаДок.Док);
				ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НовСтр, СтрокаДок.Док, "Приобретение");
				СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
	        			                                 СтрокаДок.Док.Контрагент, СтрокаДок.Док.ТипЦен, СтрокаДок.Док.ДоговорКонтрагента, СтрокаДок.Док.Дата,СтрокаДок.Док.ВалютаДокумента, СтрокаДок.Док.УчитыватьНДС,СтрокаДок.Док.СуммаВключаетНДС);
				ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(НовСтр, СтрокаДок.Док, СтруктураШапкиДокумента, глЗначениеПеременной("ВалютаРегламентированногоУчета"), Истина);
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтр, СтрокаДок.Док);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтр, СтрокаДок.Док);
			КонецЕсли;
		КонецЦикла;
		//СтрокаДок.Док.Записать(РежимЗаписиДокумента.Запись);
		Форма = СтрокаДок.Док.ПолучитьФорму();
		Форма.Открыть();
	КонецЦикла;

КонецПроцедуры

Процедура РезультатПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)

	Категория = Справочники.КатегорииОбъектов.НайтиПоКоду("000000185");//Акция ВВ
	Если ИТИИндустрияОбщийМодульКлиентСервер.ПринадлежитКатегории(ДанныеСтроки.Номенклатура, Категория) Тогда
		ОформлениеСтроки.Шрифт = Новый Шрифт(ОформлениеСтроки.Шрифт,,,Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ПриОткрытии()
	Если ПостроительМатрицыТочки.Отбор.Количество()=0 Тогда
		ПостроительМатрицыТочки.Отбор.Добавить("КлассТорговойТочки",,"Класс торговой точки");
		ПостроительМатрицыТочки.Отбор.Добавить("Склад");
		ПостроительМатрицыТочки.Отбор.Добавить("НоменклатурнаяГруппа",,"Номенклатурная группа");
		ПостроительМатрицыТочки.Отбор.Добавить("Поставщик");
	КонецЕсли;
КонецПроцедуры

Процедура ПередСохранениемЗначений(Отказ)
	НастройкиПостроителя=ЗначениеВСтрокуВнутр(ПостроительМатрицыТочки.ПолучитьНастройки());
КонецПроцедуры

Процедура ПослеВосстановленияЗначений()
	Если ЗначениеЗаполнено(НастройкиПостроителя) Тогда
		ПостроительМатрицыТочки.УстановитьНастройки(ЗначениеИзСтрокиВнутр(НастройкиПостроителя));
	КонецЕсли;
КонецПроцедуры

ПостроительМатрицыТочки.Текст="ВЫБРАТЬ
	                              |	МатрицаТорговойТочкиСрезПоследних.КлассТорговойТочки,
	                              |	Склады.Ссылка КАК Склад,
	                              |	МатрицаТорговойТочкиСрезПоследних.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	                              |	МатрицаТорговойТочкиСрезПоследних.Номенклатура,
	                              |	МатрицаТорговойТочкиСрезПоследних.ХарактеристикаНоменклатуры,
	                              |	ВЫБОР
	                              |		КОГДА МатрицаТорговойТочкиСрезПоследних.Номенклатура.ОсновнойПоставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                              |			ТОГДА МатрицаТорговойТочкиСрезПоследних.Номенклатура.Поставщик2
	                              |		ИНАЧЕ МатрицаТорговойТочкиСрезПоследних.Номенклатура.ОсновнойПоставщик
	                              |	КОНЕЦ КАК Поставщик,
	                              |	МатрицаТорговойТочкиСрезПоследних.Количество
	                              |ИЗ
	                              |	РегистрСведений.МатрицаТорговойТочки.СрезПоследних КАК МатрицаТорговойТочкиСрезПоследних
	                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	                              |		ПО МатрицаТорговойТочкиСрезПоследних.КлассТорговойТочки = Склады.КлассТорговойТочки
	                              |{ГДЕ
	                              |	МатрицаТорговойТочкиСрезПоследних.КлассТорговойТочки КАК КлассТорговойТочки,
	                              |	Склады.Ссылка КАК Склад,
	                              |	МатрицаТорговойТочкиСрезПоследних.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	                              |	(ВЫБОР
	                              |			КОГДА МатрицаТорговойТочкиСрезПоследних.Номенклатура.ОсновнойПоставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                              |				ТОГДА МатрицаТорговойТочкиСрезПоследних.Номенклатура.Поставщик2
	                              |			ИНАЧЕ МатрицаТорговойТочкиСрезПоследних.Номенклатура.ОсновнойПоставщик
	                              |		КОНЕЦ) КАК Поставщик}";
ПостроительМатрицыТочки.Выполнить();
