
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если Склад.ЭтоГруппа Тогда
		Выборка=Справочники.Склады.ВыбратьИерархически(Склад);
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ЭтоГруппа Тогда
				ДатьПрава(Пользователь,Выборка.Ссылка,Запись);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ДатьПрава(Пользователь,Склад,Запись);
	КонецЕсли;
КонецПроцедуры

Процедура ДатьПрава(Юзер,ДобавлСклад,ДатьЗапись)
	НоваяЗапись=РегистрыСведений.ПраваДоступа.СоздатьМенеджерЗаписи();
	НоваяЗапись.ВидОбъектДоступа=Перечисления.ВидыОбъектовДоступа.СправочникСклады;
	НоваяЗапись.ВладелецДоступа=Юзер;
	НоваяЗапись.ОбъектДоступа=ДобавлСклад;
	НоваяЗапись.Чтение=Истина;
	НоваяЗапись.Изменение=ДатьЗапись;
	НоваяЗапись.Записать(Истина);
КонецПроцедуры
