
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Набор=РегистрыНакопления.ПродажиСебестоимость.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(ИспрДокумент);
	Набор.Прочитать();
	Для Каждого Запись Из Набор Цикл
		Если Запись.Номенклатура=Номенклатура Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Запись.Номенклатура<>Номенклатура Тогда
		Запись=Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,Набор.Получить(0));
		Запись.Номенклатура=Номенклатура;
	КонецЕсли;
	Если Запись.Количество<>Количество Тогда
		Запись.Количество=Количество;
	КонецЕсли;
	Если Запись.ДокументОприходования<>ДокументОприходования Тогда
		Запись.ДокументОприходования=ДокументОприходования;
	КонецЕсли;
	Если Запись.Стоимость<>Количество*Цена Тогда
		Запись.Стоимость=Количество*Цена;
	КонецЕсли;
	Если Набор.Модифицированность() Тогда
		Набор.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ИспрДокументПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		НужнаяСтрока=ИспрДокумент.Товары.Найти(Номенклатура,"Номенклатура");
		Если НужнаяСтрока<>Неопределено Тогда
			Количество=НужнаяСтрока.Количество;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
