
&НаСервере
Процедура УдалитьСборкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаТоваров.Ссылка
		|ИЗ
		|	Документ.СборкаТоваров КАК СборкаТоваров
		|ГДЕ
		|	СборкаТоваров.Проведен
		|	И СборкаТоваров.ДокументОснование.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Об.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСборки(Команда)
	УдалитьСборкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьОприходованияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОприходованиеТоваров.Ссылка
		|ИЗ
		|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
		|ГДЕ
		|	ОприходованиеТоваров.Проведен
		|	И ОприходованиеТоваров.ДокументОснование.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Об.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОприходования(Команда)
	УдалитьОприходованияНаСервере();
КонецПроцедуры

&НаСервере
Процедура АрхивироватьЧекиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМ.Ссылка
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|ГДЕ
		|	ЧекККМ.Проведен
		|	И ЧекККМ.СтатусЧекаККМ = &Пробитый";
	
	Запрос.УстановитьПараметр("Пробитый", Перечисления.СтатусыЧековККМ.Пробитый);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Об.СтатусЧекаККМ=Перечисления.СтатусыЧековККМ.Архивный;
		Об.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура АрхивироватьЧеки(Команда)
	АрхивироватьЧекиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсправлениеОтчетовНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтчетОРозничныхПродажахТовары.Ссылка
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
		|ГДЕ
		|	ОтчетОРозничныхПродажахТовары.СтавкаНДС = &СтавкаНДС
		|	И НЕ ОтчетОРозничныхПродажахТовары.Ссылка.ПометкаУдаления
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("СтавкаНДС", Перечисления.СтавкиНДС.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ПустойНДС=Об.Товары.НайтиСтроки(Новый Структура("СтавкаНДС",Перечисления.СтавкиНДС.ПустаяСсылка()));
		Для Каждого КриваяСтрока Из ПустойНДС Цикл
			КриваяСтрока.СтавкаНДС=Перечисления.СтавкиНДС.БезНДС;
		КонецЦикла;
		Если Об.Модифицированность() Тогда
			Об.Записать();
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура ИсправлениеОтчетов(Команда)
	ИсправлениеОтчетовНаСервере();
КонецПроцедуры
