
Процедура КнопкаВыполнитьНажатие(Кнопка)
	НоваяУчетка=ТиповаяУчетка.ПолучитьОбъект().Скопировать();
	НоваяУчетка.АдресЭлектроннойПочты	=Почта;
	НоваяУчетка.Наименование			=Пользователь.Наименование;
	НоваяУчетка.ЛогинSMTP				=Почта;
	НоваяУчетка.ПарольSMTP				=Пароль;
	НоваяУчетка.Логин					=Почта;
	НоваяУчетка.Пароль					=Пароль;
	НоваяУчетка.ДоступКУчетнойЗаписи.Очистить();
	СтрокаДоступа=НоваяУчетка.ДоступКУчетнойЗаписи.Добавить();
	СтрокаДоступа.Пользователь=глЗначениеПеременной("глТекущийПользователь");
	СтрокаДоступа.Администрирование=Истина;
	СтрокаДоступа.Запись=Истина;
	
	СтрокаДоступа=НоваяУчетка.ДоступКУчетнойЗаписи.Добавить();
	СтрокаДоступа.Пользователь=Пользователь;
	СтрокаДоступа.Администрирование=Ложь;
	СтрокаДоступа.Запись=Истина;
	
	НоваяУчетка.ГруппаВходящие=Неопределено;
	НоваяУчетка.ГруппаИсходящие=Неопределено;
	НоваяУчетка.ГруппаУдаленные=Неопределено;
	НоваяУчетка.ГруппаЧерновики=Неопределено;
	
	Попытка
		Форма=НоваяУчетка.ПолучитьФорму();
		Форма.Открыть();
		Форма.ЗаписатьВФорме();
		Форма.Закрыть();
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось создать запись "+ОписаниеОшибки());
		Возврат
	КонецПопытки;
	
	Если НЕ НоваяУчетка.Ссылка.Пустая() Тогда
		НаборЗаписей=РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		НаборЗаписей.Отбор.Настройка.Установить(ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяУчетнаяЗапись);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		Запись=НаборЗаписей.Добавить();
		Запись.Пользователь=Пользователь;
		Запись.Настройка=ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяУчетнаяЗапись;
		Запись.Значение=НоваяУчетка.Ссылка;
	КонецЕсли;
КонецПроцедуры
