Перем мТекущаяНастройка;

Процедура ПриОткрытии()

	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Пользователь", глЗначениеПеременной("глТекущийПользователь"));
	СтруктураНастройки.Вставить("ИмяОбъекта", "Обработка.СоздатьРТУПоМашинам");
	Если УниверсальныеМеханизмы.ПолучитьНастройкуИспользоватьПриОткрытии(СтруктураНастройки) Тогда
		мТекущаяНастройка = СтруктураНастройки;
		ВосстановитьНастройкиИзСтруктуры(СтруктураНастройки.СохраненнаяНастройка);
	КонецЕсли;

КонецПроцедуры

Процедура КоманднаяПанельФормыДействиеСохранитьЗначения(Кнопка)

	СохранитьНастройки();

КонецПроцедуры

Процедура КоманднаяПанельФормыДействиеВосстановитьЗначения(Кнопка)

	ВосстановитьНастройки();

КонецПроцедуры

Функция ВосстановитьНастройки()

	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Пользователь", глЗначениеПеременной("глТекущийПользователь"));
	СтруктураНастройки.Вставить("ИмяОбъекта", "Обработка.СоздатьРТУПоМашинам");
	СтруктураНастройки.Вставить("НаименованиеНастройки", ?(мТекущаяНастройка = Неопределено, Неопределено, мТекущаяНастройка.НаименованиеНастройки));
	Результат = УниверсальныеМеханизмы.ВосстановлениеНастроек(СтруктураНастройки);
	Если Результат <> Неопределено Тогда
		мТекущаяНастройка = Результат;
		ВосстановитьНастройкиИзСтруктуры(Результат.СохраненнаяНастройка);
	Иначе
		мТекущаяНастройка = СтруктураНастройки;
	КонецЕсли;

КонецФункции

Процедура СохранитьНастройки()

	Перем СохраненнаяНастройка;
	СформироватьСтруктуруДляСохраненияНастроек(СохраненнаяНастройка);
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Пользователь", глЗначениеПеременной("глТекущийПользователь"));
	СтруктураНастройки.Вставить("ИмяОбъекта", "Обработка.СоздатьРТУПоМашинам");
	СтруктураНастройки.Вставить("НаименованиеНастройки", ?(мТекущаяНастройка = Неопределено, Неопределено, мТекущаяНастройка.НаименованиеНастройки));
	СтруктураНастройки.Вставить("СохраненнаяНастройка", СохраненнаяНастройка);
	СтруктураНастройки.Вставить("ИспользоватьПриОткрытии", Ложь);
	СтруктураНастройки.Вставить("СохранятьАвтоматически", Ложь);
	Результат = УниверсальныеМеханизмы.СохранениеНастроек(СтруктураНастройки);
	Если Результат <> Неопределено Тогда
		мТекущаяНастройка = Результат;
	Иначе
		мТекущаяНастройка = СтруктураНастройки;
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками)

	Если ТипЗнч(СтруктураСНастройками)<>Тип("Структура") Тогда
		СтруктураСНастройками = Новый Структура;
	КонецЕсли;
	СтруктураСНастройками.Вставить("СписокМашин", СписокМашин);

КонецПроцедуры

Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками)

	Если ТипЗнч(СтруктураСНастройками)=Тип("Структура") Тогда
		Для каждого Настройка из СтруктураСНастройками Цикл
			Если Настройка.Ключ = "СписокМашин" Тогда
				СписокМашин = Настройка.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Истина;

КонецФункции