	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ПриходныйОрдерНаТоварыВозвратнаяТара.Ссылка,
	//	|	ПриходныйОрдерНаТоварыВозвратнаяТара.Ссылка.ДокументПеремещения КАК ДокументПеремещения
	//	|ИЗ
	//	|	Документ.ПриходныйОрдерНаТовары.ВозвратнаяТара КАК ПриходныйОрдерНаТоварыВозвратнаяТара
	//	|ГДЕ
	//	|	ПриходныйОрдерНаТоварыВозвратнаяТара.Ссылка.Проведен
	//	|	И ПриходныйОрдерНаТоварыВозвратнаяТара.ДокументПеремещения = НЕОПРЕДЕЛЕНО
	//	|	И ПриходныйОрдерНаТоварыВозвратнаяТара.Ссылка.ВидОперации = &ВидОперации
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ПриходныйОрдерНаТоварыВозвратнаяТара.Ссылка.Дата";

	//Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПриходныйОрдер.Перемещение);

	//Результат = Запрос.Выполнить();

	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//	Для Каждого СтрокаТЧ ИЗ Об.ВозвратнаяТара Цикл
	//		СтрокаТЧ.ДокументПеремещения=ВыборкаДетальныеЗаписи.ДокументПеремещения;
	//	КонецЦикла;
	//	Об.Комментарий=Об.Комментарий+" Исправлен 03.03.2015 КАВ";
	//	Попытка
	//	
	//		Об.Записать(РежимЗаписиДокумента.Проведение);
	//	
	//	Исключение
	//		Сообщить("Не удалось провести "+Строка(ВыборкаДетальныеЗаписи.Ссылка));
	//	КонецПопытки;
	//КонецЦикла;
