Перем мОбъект Экспорт;

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	СоедСПапкой = мОбъект.Драйвер.ПолучитьНастройкуТерминала("folderBasedExchange");
	Если СоедСПапкой = Неопределено Тогда
		ТипСвязи = Неопределено;
	ИначеЕсли СоедСПапкой = "true" Тогда
		ТипСвязи = "Папка";
	Иначе
		ТипСвязи = "Сервер";
	КонецЕсли;
	
	Адрес = мОбъект.Драйвер.ПолучитьНастройкуТерминала("webService");
	Прокси = мОбъект.Драйвер.ПолучитьНастройкуТерминала("proxy");
	
	СтрокаПодключенияКСерверу = ПолучитьАдресСервера(Адрес);
	//ПортПрокси = Число(мОбъект.ПолучитьНастройкуТерминала("proxy"));
КонецПроцедуры

Функция ПолучитьАдресСервера(СтрокаПодключ)
	Если ПустаяСтрока(СтрокаПодключ) Тогда
		Возврат ПолучитьIPПоУмолчанию();
	КонецЕсли;
	
	Инд = Найти(СтрокаПодключ, "://");
	Если Инд > 0 Тогда
		СтрокаПодключ = Прав(СтрокаПодключ, СтрДлина(СтрокаПодключ)-Инд-2);
	КонецЕсли;
	
	Инд = Найти(СтрокаПодключ, "/");
	Если Инд > 0 Тогда
		СтрокаПодключ = Лев(СтрокаПодключ, Инд-1);
	КонецЕсли;

	Инд = Найти(СтрокаПодключ, ":");
	Если Инд > 0 Тогда
		Порт = Прав(СтрокаПодключ, СтрДлина(СтрокаПодключ)-Инд);
		Если Порт = "9400" Тогда
			СтрокаПодключ = Лев(СтрокаПодключ, Инд-1);
		КонецЕсли;
	КонецЕсли;

	Возврат СтрокаПодключ;
КонецФункции

Процедура УстановитьНажатие(Элемент)
	Если ТипСвязи = "Папка" Тогда
		мОбъект.Драйвер.УстановитьНастройкуТерминала("folderBasedExchange", "true");
	ИначеЕсли ТипСвязи = "Сервер" Тогда
		мОбъект.Драйвер.УстановитьНастройкуТерминала("folderBasedExchange", "false");
	КонецЕсли;
	
	мОбъект.Драйвер.УстановитьНастройкуТерминала("webService", ПолучитьСтрокуПодключения(СтрокаПодключенияКСерверу));
	мОбъект.Драйвер.УстановитьНастройкуТерминала("proxy", Прокси);
КонецПроцедуры
