
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ТекДата=НачПериода;
	Пока ТекДата<КонПериода Цикл
		Сообщить(ТекДата);
		ВыравниваниеПеремещений(НачалоДня(ТекДата));
		ТекДата=КонецДня(ТекДата)+1;
	КонецЦикла;
КонецПроцедуры

Процедура ВыравниваниеПеремещений(ДатаРаботы)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	НЕ ПеремещениеТоваров.ПометкаУдаления
		|	И ПеремещениеТоваров.ДатаОтгрузки МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОтгрузки, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОтгрузки, ДЕНЬ)
		//|	И НАЧАЛОПЕРИОДА(ПеремещениеТоваров.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(ПеремещениеТоваров.ДатаОтгрузки, ДЕНЬ)
		|	И ПеремещениеТоваров.СкладПолучатель В ИЕРАРХИИ(&Магазины)";

	Запрос.УстановитьПараметр("ДатаОтгрузки",	ДатаРаботы);
	Запрос.УстановитьПараметр("Магазины",		Справочники.Склады.НайтиПоКоду("000000103"));

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВремяПеремещения=НачалоДня(ДатаРаботы)+3*60*60;
	ВремяРасхОрдера=НачалоДня(ДатаРаботы)+3*60*60+10*60;
	ВремяПрихОрдера=НачалоДня(ДатаРаботы)+3*60*60+20*60;
	ЭлементыФормы.Индикатор.МаксимальноеЗначение=ВыборкаДетальныеЗаписи.Количество();
	Индикатор=0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Индикатор=Индикатор+1;
		Об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если Об.Дата<>ВремяПеремещения Тогда
			Об.Дата=ВремяПеремещения;
			Если Об.Проведен Тогда
				Об.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			Иначе
				Об.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
		ПодчинДоки=КритерииОтбора.СвязанныеДокументы.Найти(Об.Ссылка);
		Для Каждого Ссылка из ПодчинДоки Цикл
			Если ТипЗнч(Ссылка)=Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
				Об=Ссылка.ПолучитьОбъект();
				Если Об.Дата<>ВремяПрихОрдера Тогда
					Об.Дата=ВремяПрихОрдера;
					Если Об.Проведен Тогда
						Об.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
					Иначе
						Об.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
				Об=Ссылка.ПолучитьОбъект();
				Если Об.Дата<>ВремяРасхОрдера Тогда
					Об.Дата=ВремяРасхОрдера;
					Если Об.Проведен Тогда
						Об.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
					Иначе
						Об.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры
