Перем ОтчетПоВерсионированию;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	ИндикаторДокументов=0;
	ИндикаторРазборВерсия=0;
	
	//1. Определяем "раннюю версию" для документов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.Объект КАК Документ,
		|	ВерсииОбъектов.НомерВерсии,
		|	ВерсииОбъектов.ДатаВерсии,
		|	ВерсииОбъектов.АвторВерсии
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВерсииОбъектов.Объект КАК Объект,
		|		МИНИМУМ(ВерсииОбъектов.ДатаВерсии) КАК ДатаВерсии
		|	ИЗ
		|		РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|	ГДЕ
		|		ВерсииОбъектов.Объект В(&МассивДокументов)
		|		И ВерсииОбъектов.ДатаВерсии МЕЖДУ &НачПериода И &КонПериода
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВерсииОбъектов.Объект) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|		ПО ВложенныйЗапрос.Объект = ВерсииОбъектов.Объект
		|			И ВложенныйЗапрос.ДатаВерсии = ВерсииОбъектов.ДатаВерсии";
		
	Запрос.УстановитьПараметр("МассивДокументов", СписокДокументовДляАнализа.ВыгрузитьКолонку("Документ"));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВызватьИсключение "Не найдено оригинальных версий объектов";
	КонецЕсли;
	ТаблицаОригинальныхВерсий=ПолучитьТаблицуВерсийПоЗапросу(Результат,"Расчет оригинальных версий","ИндикаторДокументов");
	
КонецПроцедуры

Функция ПолучитьТаблицуВерсийПоЗапросу(РезультатЗапроса,СообщениеСостояния,ИндикаторПроцесса)
	Версии=РезультатЗапроса.Выбрать();
	
#Область Инициализация_таблицы
	ТаблицаОригинальныхВерсий=Новый ТаблицаЗначений;
	ТаблицаОригинальныхВерсий.Колонки.Добавить("Документ");
	ТаблицаОригинальныхВерсий.Колонки.Добавить("НомерВерсии",	ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,0));
	ТаблицаОригинальныхВерсий.Колонки.Добавить("ДатаВерсии",	ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ТаблицаОригинальныхВерсий.Колонки.Добавить("АвторВерсии",	Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	ТаблицаОригинальныхВерсий.Колонки.Добавить("НомерСтроки",	ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,0));
	ТаблицаОригинальныхВерсий.Колонки.Добавить("Номенклатура",	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаОригинальныхВерсий.Колонки.Добавить("Количество",	ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));	
#КонецОбласти
	Состояние(СообщениеСостояния);
	ЭлементыФормы[ИндикаторПроцесса].МаксимальноеЗначение=Версии.Количество();
	ИндикаторДокументов=0;
	Пока Версии.Следующий() Цикл
		//Получим объект
		ОтчетПоВерсионированию.СсылкаНаОбъект=Версии.Документ;
		Оригинал=ОтчетПоВерсионированию.ПолучитьОбъектИзXML(ОтчетПоВерсионированию.ПолучитьСтрокуXMLПоНомеруВерсии(Версии.НомерВерсии));
		ЭтаФорма[ИндикаторПроцесса]=ЭтаФорма[ИндикаторПроцесса]+1;
	КонецЦикла;
	Состояние("");
КонецФункции

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

ОтчетПоВерсионированию=Отчеты.ИсторияИзмененийОбъектов.Создать();