
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ИндикаторДокументов=0;
	ИндикаторРазборВерсия=0;
	
	//1. Определяем "раннюю версию" для документов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.Объект КАК Документ,
		|	ВерсииОбъектов.НомерВерсии,
		|	ВерсииОбъектов.ДатаВерсии,
		|	ВерсииОбъектов.АвторВерсии
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВерсииОбъектов.Объект КАК Объект,
		|		МИНИМУМ(ВерсииОбъектов.ДатаВерсии) КАК ДатаВерсии
		|	ИЗ
		|		РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|	ГДЕ
		|		ВерсииОбъектов.Объект В(&МассивДокументов)
		|		И ВерсииОбъектов.ДатаВерсии МЕЖДУ &НачПериода И &КонПериода
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВерсииОбъектов.Объект) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|		ПО ВложенныйЗапрос.Объект = ВерсииОбъектов.Объект
		|			И ВложенныйЗапрос.ДатаВерсии = ВерсииОбъектов.ДатаВерсии";
		
	Запрос.УстановитьПараметр("МассивДокументов", СписокДокументовДляАнализа.ВыгрузитьКолонку("Документ"));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВызватьИсключение "Не найдено оригинальных версий объектов";
	КонецЕсли;
	ТаблицаОригинальныхВерсий=ПолучитьТаблицуВерсийПоЗапросу(Результат.Выбрать(),"Расчет оригинальных версий","ИндикаторДокументов",ЭтаФорма);
	
	//2. Определяем остальные для документов
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.Объект КАК Документ,
		|	ВерсииОбъектов.НомерВерсии,
		|	ВерсииОбъектов.ДатаВерсии,
		|	ВерсииОбъектов.АвторВерсии
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВерсииОбъектов.Объект КАК Объект,
		|		МИНИМУМ(ВерсииОбъектов.ДатаВерсии) КАК ДатаВерсии
		|	ИЗ
		|		РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|	ГДЕ
		|		ВерсииОбъектов.Объект В(&МассивДокументов)
		|		И ВерсииОбъектов.ДатаВерсии МЕЖДУ &НачПериода И &КонПериода
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВерсииОбъектов.Объект) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|		ПО ВложенныйЗапрос.Объект = ВерсииОбъектов.Объект
		|			И ВложенныйЗапрос.ДатаВерсии < ВерсииОбъектов.ДатаВерсии
		|ИТОГИ ПО
		|	Документ";
	Результат=запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВызватьИсключение "Нет версий объектов для анализа";
	КонецЕсли;                                                 
	ТаблицаВерсий=ТаблицаОригинальныхВерсий.Скопировать();
	ТаблицаВерсий.Очистить();
	ВыборкаДокументов=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ИндикаторДокументов=0;
	
	ТаблицаРезультат=ИнициализацияИтоговойТаблицы();
	Пока ВыборкаДокументов.Следующий() Цикл
		ВыборкаВерсий=ВыборкаДокументов.Выбрать();
		ИндикаторРазборВерсия=0;
		ТабТемп=ПолучитьТаблицуВерсийПоЗапросу(ВыборкаВерсий,"Расчет версий для "+Строка(ВыборкаДокументов.Документ),"ИндикаторРазборВерсия",ЭтаФорма);
		
		ИндикаторДокументов=ИндикаторДокументов+1;
	КонецЦикла;
	
#Область Мусор
	//3. Запрос построитель отчета
	
	Запрос = Новый Запрос;

#Область Рабочий_запрос
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОригинальныхВерсий.НомерСтроки,
		|	ТаблицаОригинальныхВерсий.Документ,
		|	ТаблицаОригинальныхВерсий.Номенклатура,
		|	ТаблицаОригинальныхВерсий.Количество,
		|	ТаблицаОригинальныхВерсий.АвторВерсии,
		|	ТаблицаОригинальныхВерсий.НомерВерсии,
		|	ТаблицаОригинальныхВерсий.ДатаВерсии
		|ПОМЕСТИТЬ ВТ_Оригиналы
		|ИЗ
		|	&ТаблицаОригинальныхВерсий КАК ТаблицаОригинальныхВерсий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Версии.НомерСтроки,
		|	ВТ_Версии.Документ,
		|	ВТ_Версии.Номенклатура,
		|	ВТ_Версии.Количество,
		|	ВТ_Версии.АвторВерсии,
		|	ВТ_Версии.НомерВерсии,
		|	ВТ_Версии.ДатаВерсии
		|ПОМЕСТИТЬ ВТ_Версии
		|ИЗ
		|	&ТаблицаВерсий КАК ВТ_Версии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Оригиналы.Документ КАК ДокументОригинал,
		|	ВТ_Оригиналы.АвторВерсии КАК АвторВерсииОригинал,
		|	ВТ_Оригиналы.НомерВерсии КАК НомерВерсииОригинал,
		|	ВТ_Оригиналы.ДатаВерсии КАК ДатаВерсииОригинал,
		|	ВТ_Версии.АвторВерсии,
		|	ВТ_Версии.НомерВерсии,
		|	ВТ_Версии.ДатаВерсии,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_Оригиналы.НомерСтроки ЕСТЬ NULL 
		|				ТОГДА 1
		|			КОГДА ВТ_Версии.НомерСтроки ЕСТЬ NULL 
		|				ТОГДА 1
		|			КОГДА ВТ_Оригиналы.НомерСтроки = ВТ_Версии.НомерСтроки
		|				ТОГДА ВЫБОР
		|						КОГДА ВТ_Оригиналы.Номенклатура ЕСТЬ НЕ NULL 
		|								И ВТ_Оригиналы.Количество ЕСТЬ НЕ NULL 
		|								И ВТ_Версии.Номенклатура ЕСТЬ НЕ NULL 
		|								И ВТ_Версии.Количество ЕСТЬ НЕ NULL 
		|								И ВТ_Оригиналы.Номенклатура = ВТ_Версии.Номенклатура
		|								И ВТ_Версии.Количество = ВТ_Оригиналы.Количество
		|							ТОГДА 0
		|						ИНАЧЕ 1
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СчетчикРазличий
		|ИЗ
		|	ВТ_Оригиналы КАК ВТ_Оригиналы
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Версии КАК ВТ_Версии
		|		ПО ВТ_Оригиналы.Документ = ВТ_Версии.Документ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Оригиналы.Документ,
		|	ВТ_Оригиналы.АвторВерсии,
		|	ВТ_Оригиналы.НомерВерсии,
		|	ВТ_Оригиналы.ДатаВерсии,
		|	ВТ_Версии.АвторВерсии,
		|	ВТ_Версии.НомерВерсии,
		|	ВТ_Версии.ДатаВерсии";
#КонецОбласти

#Область Тестовый_запрос
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОригинальныхВерсий.НомерСтроки,
		|	ТаблицаОригинальныхВерсий.Документ,
		|	ТаблицаОригинальныхВерсий.Номенклатура,
		|	ТаблицаОригинальныхВерсий.Количество,
		|	ТаблицаОригинальныхВерсий.АвторВерсии,
		|	ТаблицаОригинальныхВерсий.НомерВерсии,
		|	ТаблицаОригинальныхВерсий.ДатаВерсии
		|ПОМЕСТИТЬ ВТ_Оригиналы
		|ИЗ
		|	&ТаблицаОригинальныхВерсий КАК ТаблицаОригинальныхВерсий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Версии.НомерСтроки,
		|	ВТ_Версии.Документ,
		|	ВТ_Версии.Номенклатура,
		|	ВТ_Версии.Количество,
		|	ВТ_Версии.АвторВерсии,
		|	ВТ_Версии.НомерВерсии,
		|	ВТ_Версии.ДатаВерсии
		|ПОМЕСТИТЬ ВТ_Версии
		|ИЗ
		|	&ТаблицаВерсий КАК ВТ_Версии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Оригиналы.НомерСтроки КАК НомерСтрокиОригинал,
		|	ВТ_Оригиналы.Документ КАК ДокументОригинал,
		|	ВТ_Оригиналы.Номенклатура КАК НоменклатураОригинал,
		|	ВТ_Оригиналы.Количество КАК КоличествоОригинал,
		|	ВТ_Оригиналы.АвторВерсии КАК АвторВерсииОригинал,
		|	ВТ_Оригиналы.НомерВерсии КАК НомерВерсииОригинал,
		|	ВТ_Оригиналы.ДатаВерсии КАК ДатаВерсииОригинал,
		|	ВТ_Версии.НомерСтроки КАК НомерСтроки,
		|	ВТ_Версии.Документ КАК Документ,
		|	ВТ_Версии.Номенклатура КАК Номенклатура,
		|	ВТ_Версии.Количество КАК Количество,
		|	ВТ_Версии.АвторВерсии КАК АвторВерсии,
		|	ВТ_Версии.НомерВерсии КАК НомерВерсии,
		|	ВТ_Версии.ДатаВерсии КАК ДатаВерсии
		|ИЗ
		|	ВТ_Оригиналы КАК ВТ_Оригиналы
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Версии КАК ВТ_Версии
		|		ПО ВТ_Оригиналы.Документ = ВТ_Версии.Документ";
#КонецОбласти

#Область Новый_запрос
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ_Версии.НомерСтроки,
		|	ВТ_Версии.Документ,
		|	ВТ_Версии.Номенклатура,
		|	ВТ_Версии.Количество,
		|	ВТ_Версии.АвторВерсии,
		|	ВТ_Версии.НомерВерсии,
		|	ВТ_Версии.ДатаВерсии
		|ПОМЕСТИТЬ ВТ_Версии
		|ИЗ
		|	&ТаблицаВерсий КАК ВТ_Версии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Версии.НомерСтроки КАК НомерСтроки,
		|	ВТ_Версии.Документ КАК Документ,
		|	ВТ_Версии.Номенклатура КАК Номенклатура,
		|	ВТ_Версии.Количество КАК Количество,
		|	ВТ_Версии.АвторВерсии КАК АвторВерсии,
		|	ВТ_Версии.НомерВерсии КАК НомерВерсии,
		|	ВТ_Версии.ДатаВерсии КАК ДатаВерсии
		|ИЗ
		|	ВТ_Версии КАК ВТ_Версии
		|ИТОГИ
		|	МАКСИМУМ(АвторВерсии),
		|	МАКСИМУМ(НомерВерсии),
		|	МАКСИМУМ(ДатаВерсии)
		|ПО
		|	Документ";

#КонецОбласти
	Запрос.УстановитьПараметр("ТаблицаОригинальныхВерсий",	ТаблицаОригинальныхВерсий);
	Запрос.УстановитьПараметр("ТаблицаВерсий",				ТаблицаВерсий);
	РезультатЗапроса = Запрос.Выполнить();
	ДеревоВерсий=РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
#КонецОбласти
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

ОтчетПоВерсионированию=Отчеты.ИсторияИзмененийОбъектов.Создать();