
Процедура КнопкаВыполнитьНажатие(Кнопка)
	//1. Формируем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Код,
		|	Номенклатура.ЕдиницаИзмеренияМест.Коэффициент КАК КратностьМест
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//2. Запись в XML
	ЗаписьXML = Новый ЗаписьXML();
    ЗаписьXML.УстановитьСтроку();
    СериализаторXDTO.ЗаписатьXML(ЗаписьXML, РезультатЗапроса.Выгрузить());
    СтрокаXML = ЗаписьXML.Закрыть();
	ЗаписьТекста=Новый ЗаписьТекста(Путь);
	ЗаписьТекста.Записать(СтрокаXML);
	ЗаписьТекста.Закрыть();

КонецПроцедуры

Процедура ПутьНачалоВыбора(Элемент, СтандартнаяОбработка)
	Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр="XML|*.xml";
	Если Диалог.Выбрать() Тогда
		Путь=Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

Процедура ОсновныеДействияФормыЗагрузить(Кнопка)
	ЧтениеXML=Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Путь);
	
	ТЗ=СериализаторXDTO.ПрочитатьXML(ЧтениеXML,Тип("ТаблицаЗначений"));
	
	Для Каждого СтрокаТЧ Из ТЗ Цикл 
		Ном=Справочники.Номенклатура.НайтиПоКоду(СтрокаТЧ.Код);
		Если ЗначениеЗаполнено(Ном) Тогда
			Об=Ном.ПолучитьОбъект();
		Иначе
			Продолжить;
		КонецЕсли;
		
		Об.КратностьМест=СтрокаТЧ.КратностьМест;
		Об.Записать();
	КонецЦикла;
КонецПроцедуры
