
&НаСервере
Процедура СоздатьСписанияНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах,
		|	ЧекККМПодарки.Номенклатура КАК Номенклатура,
		|	СУММА(ЧекККМПодарки.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	ЧекККМПодарки.Характеристика,
		|	СУММА(ЧекККМПодарки.Количество) КАК Количество,
		|	СРЕДНЕЕ(ЧекККМПодарки.Цена) КАК Цена,
		|	ЧекККМПодарки.Упаковка
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Подарки КАК ЧекККМПодарки
		|		ПО ЧекККМ.Ссылка = ЧекККМПодарки.Ссылка
		|ГДЕ
		|	ЧекККМ.ОтчетОРозничныхПродажах.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЧекККМПодарки.Номенклатура,
		|	ЧекККМ.ОтчетОРозничныхПродажах,
		|	ЧекККМПодарки.Характеристика,
		|	ЧекККМПодарки.Упаковка
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЧекККМПодарки.КоличествоУпаковок) > 0
		|ИТОГИ ПО
		|	ОтчетОРозничныхПродажах";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ВыборкаОтчетОРозничныхПродажах = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОтчетОРозничныхПродажах.Следующий() Цикл
		СписаниеПодарков=Документы.СписаниеТоваров.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(СписаниеПодарков,ВыборкаОтчетОРозничныхПродажах.ОтчетОРозничныхПродажах,,"Номер");
		СписаниеПодарков.АналитикаХозяйственнойОперации=Справочники.АналитикаХозяйственныхОпераций.СкидкиПодарки;
		СписаниеПодарков.ОтчетОРозничныхПродажах=ВыборкаОтчетОРозничныхПродажах.ОтчетОРозничныхПродажах;
		СписаниеПодарков.Склад=ВыборкаОтчетОРозничныхПродажах.ОтчетОРозничныхПродажах.Магазин.СкладПродажи;
		ВыборкаДетальныеЗаписи = ВыборкаОтчетОРозничныхПродажах.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТЧ=СписаниеПодарков.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаДетальныеЗаписи);
			СтрокаТЧ.Цена=1;
			СтрокаТЧ.Сумма=ВыборкаДетальныеЗаписи.КоличествоУпаковок;
		КонецЦикла;
		СписаниеПодарков.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписания(Команда)
	СоздатьСписанияНаСервере();
КонецПроцедуры
