
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	СтруктураВозврата = Новый Структура();
	
	Если ИзменятьСпособСвертки Тогда
		СтруктураВозврата.Вставить("СпособСвертки",СпособСвертки);
	КонецЕсли;
	
	Если ИзменятьДатуНачала Тогда
		СтруктураВозврата.Вставить("ДатаНачала",ДатаНачала);
	КонецЕсли;
	
	Если ИзменятьДатуОкончания Тогда
		СтруктураВозврата.Вставить("ДатаОкончания",ДатаОкончания);
	КонецЕсли;	
	
	Если Статус Тогда
		СтруктураВозврата.Вставить("Статус",СписокСтатусов);
	КонецЕсли;
	
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры

Процедура СпособСверткиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	Элемент.СписокВыбора.Добавить(мСпособыСверткиОбъектов.НеОбрабатывать);  
	Элемент.СписокВыбора.Добавить(мСпособыСверткиОбъектов.Очистить);  
	Элемент.СписокВыбора.Добавить(мСпособыСверткиОбъектов.ЗаПериод);
	Элемент.СписокВыбора.Добавить(мСпособыСверткиОбъектов.НаДату);
	
КонецПроцедуры

Процедура ИзменятьСпособСверткиПриИзменении(Элемент)
	
	ЭлементыФормы.СпособСвертки.Доступность = Элемент.Значение;
	
КонецПроцедуры

Процедура ИзменятьДатуНачалаПриИзменении(Элемент)
	
	ЭлементыФормы.ДатаНачала.Доступность = Элемент.Значение;
	
КонецПроцедуры

Процедура ИзменятьДатуОкончанияПриИзменении(Элемент)
	
	ЭлементыФормы.ДатаОкончания.Доступность = Элемент.Значение;
	
КонецПроцедуры

Процедура СтатусПриИзменении(Элемент)
	
	ЭлементыФормы.СписокСтатусов.Доступность = Элемент.Значение;
	
КонецПроцедуры

