
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Чтение=Новый ЧтениеТекста(ПутьДоФайла,КодировкаТекста.UTF8);
	
	Рез=CheckContractorsInEGAIS(ИНН,Чтение.Прочитать());
	Сообщить(Рез);
КонецПроцедуры

Функция CheckContractorsInEGAIS(INN, Address)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕГАИС_Контрагенты.ClientRegId,
		|	ЕГАИС_Контрагенты.description
		|ИЗ
		|	РегистрСведений.ЕГАИС_Контрагенты КАК ЕГАИС_Контрагенты
		|ГДЕ
		|	ЕГАИС_Контрагенты.INN = &INN";
	
	Запрос.УстановитьПараметр("INN", INN);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Выборка=РезультатЗапроса.Выбрать();
		Если Выборка.Количество()=1 И СтрДлина(ИНН)>10 Тогда
			Возврат Истина;
		Иначе
			СтруктураАдреса=ЗначениеИзСтрокиВнутр(Address);
			Пока Выборка.Следующий() Цикл
				Флаг=Истина;
				Для Каждого Эл Из СтруктураАдреса Цикл
					Если Найти(ВРег(Выборка.description),ВРег(Эл.Значение))=0 Тогда
						Флаг=Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Флаг=Истина Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Возврат Флаг;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

