
&НаСервере
Процедура ИсправлениеСборокНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка,
		|	ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ОтчетОРозничныхПродажахТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ПроданнаяНоменклатура
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|		ПО ОтчетОРозничныхПродажахТовары.Ссылка = ОтчетОРозничныхПродажах.Ссылка
		|ГДЕ
		|	ОтчетОРозничныхПродажах.Магазин = &Магазин
		|	И ОтчетОРозничныхПродажах.Дата >= &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетОРозничныхПродажах.Ссылка,
		|	ОтчетОРозничныхПродажахТовары.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеТоваров.Ссылка,
		|	СписаниеТоваровТовары.Номенклатура,
		|	СУММА(СписаниеТоваровТовары.Количество)
		|ИЗ
		|	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеТоваров КАК СписаниеТоваров
		|		ПО СписаниеТоваровТовары.Ссылка = СписаниеТоваров.Ссылка
		|ГДЕ
		|	СписаниеТоваров.Дата >= &Дата
		|	И СписаниеТоваров.Магазин = &Магазин
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеТоваров.Ссылка,
		|	СписаниеТоваровТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроданнаяНоменклатура.Ссылка КАК Ссылка,
		|	ПроданнаяНоменклатура.Номенклатура КАК Номенклатура,
		|	ПроданнаяНоменклатура.Количество КАК Количество,
		|	СборкаТоваров.Ссылка КАК Сборка,
		|	СборкаТоваров.Количество КАК КоличествоСборки
		|ИЗ
		|	ПроданнаяНоменклатура КАК ПроданнаяНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаТоваров
		|		ПО ПроданнаяНоменклатура.Номенклатура = СборкаТоваров.Номенклатура
		|			И ПроданнаяНоменклатура.Ссылка = СборкаТоваров.ДокументОснование
		|ГДЕ
		|	ПроданнаяНоменклатура.Количество <> СборкаТоваров.Количество";
	
	Запрос.УстановитьПараметр("Дата", Объект.ДатаИсправления);
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Док=ВыборкаДетальныеЗаписи.Сборка.ПолучитьОбъект();
		Док.Количество=ВыборкаДетальныеЗаписи.Количество;
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура ИсправлениеСборок(Команда)
	ИсправлениеСборокНаСервере();
КонецПроцедуры
