
Перем мКартинкаПустая;
Перем мКартинка_ДанныеЭтикетки_Основные;
Перем мКартинка_ДанныеЭтикетки_ДопИнформация;
Перем мКартинка_ДанныеЭтикетки_Дата;
Перем мКартинка_ДанныеЭтикетки_СрокГодности;
Перем мКартинка_ДанныеЭтикетки_СтараяЦена;
Перем мКартинка_ДанныеЭтикетки_ИмяПродавца;
Перем мКартинка_ДанныеЭтикетки_АдресПродавца;
Перем мКартинка_ДанныеЭтикетки_СтранаПроизводства;
Перем мКартинка_ДанныеЭтикетки_ИмяПроизводителя;
Перем мКартинка_ДанныеЭтикетки_ИмяПоставщика;
Перем мКартинка_ДанныеЭтикетки_АдресПоставщика;
Перем мКартинка_ДанныеЭтикетки_АртикулТовара;

Процедура ПриОткрытии()	
	
	мКартинкаПустая 							= Новый Картинка;
	мКартинка_ДанныеЭтикетки_Основные 			= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_Основные"));
	мКартинка_ДанныеЭтикетки_ДопИнформация 		= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_ДопИнформация"));
	мКартинка_ДанныеЭтикетки_Дата 				= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_Дата"));
	мКартинка_ДанныеЭтикетки_СрокГодности 		= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_СрокГодности"));
	мКартинка_ДанныеЭтикетки_СтараяЦена 		= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_СтараяЦена"));
	мКартинка_ДанныеЭтикетки_ИмяПродавца 		= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_ИмяПродавца"));
	мКартинка_ДанныеЭтикетки_АдресПродавца 		= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_АдресПродавца"));
	мКартинка_ДанныеЭтикетки_СтранаПроизводства	= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_СтранаПроизводства"));
	мКартинка_ДанныеЭтикетки_ИмяПроизводителя 	= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_ИмяПроизводителя"));
	мКартинка_ДанныеЭтикетки_ИмяПоставщика 		= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_ИмяПоставщика"));
	мКартинка_ДанныеЭтикетки_АдресПоставщика	= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_АдресПоставщика"));
	// мКартинка_ДанныеЭтикетки_АртикулТовара		= Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ДанныеЭтикетки_АртикулТовара"));
	
	ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_Основная.Картинка = мКартинка_ДанныеЭтикетки_Основные; 
	
	ЗаполнитьТабличноеПолеНастроекЭтикеток();
	ЗагрузитьНастройки();
	
	// ЭлементыФормы.ПолеГрафическойСхемы1.РежимРазмещенияНаСтранице = РежимРазмещенияНаСтранице.Авто;
	
	//ЭлементыФормы.ПолеГрафическойСхемы1.ЭлементыГрафическойСхемы.Декорация1. = Ложь;
	//
	//ЭлементыФормы.ПолеГрафическойСхемы1.ЭлементыГрафическойСхемы.Декорация1.Картинка.Вид
	//
	//ПолеВыбораЭтикеткиПриИзменении(ЭлементыФормы.ПолеВыбораЭтикетки);	
КонецПроцедуры

Процедура ЗаполнитьТабличноеПолеНастроекЭтикеток()
	
	Для Каждого мПараметр Из ОбработкаОбъект.мПараметрыМобильнойПечати Цикл
		мСтрока = ТабличноеПолеПоляЭтикетки.Добавить();	
		мСтрока.ПолеЭтикетки = мПараметр.Значение;
		мСтрока.КолонкаОписание  = мПараметр.Представление;	
		мСтрока.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолеВыбораЭтикеткиПриИзменении(Элемент)
		
	Если ЭлементыФормы.ПолеВыбораЭтикетки.Значение = "Весовая" Тогда
		ЭлементыФормы.ПолеКартинкиЭтикетки.Картинка = Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ЭтикеткаВесовая"));
	ИначеЕсли ЭлементыФормы.ПолеВыбораЭтикетки.Значение = "Товарная" Тогда
		ЭлементыФормы.ПолеКартинкиЭтикетки.Картинка = Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ЭтикеткаТоварная"));		
	Иначе // Товарная (одежда)
		ЭлементыФормы.ПолеКартинкиЭтикетки.Картинка = Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ЭтикеткаОдежда"));	
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаОКНажатие(Элемент)
	СохранитьНастройкиВ_XML();
	Закрыть(КодВозвратаДиалога.ОК);
КонецПроцедуры

Процедура КнопкаОтменаНажатие(Элемент)
	Закрыть(КодВозвратаДиалога.Отмена);
КонецПроцедуры

Процедура ЗагрузитьНастройки()
	
	Для каждого мЭлемент Из ОбработкаОбъект.мНастройкиМобильнойПечати Цикл	
		Если мЭлемент.Значение = "ВидЭтикетки" Тогда
			ПолеВыбораЭтикетки = мЭлемент.Представление;
			Продолжить;	
		КонецЕсли;
		
		мСтрока = ТабличноеПолеПоляЭтикетки.Найти(мЭлемент.Значение, "ПолеЭтикетки");
		
		Если мСтрока = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		мСтрока.Использование = Истина;
		ВключитьОтображениеДекорации(мЭлемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВключитьОтображениеДекорации(Значение)
	
	Если Значение = "AdditionInfo" Тогда 
		ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ДопИнформация.Картинка = мКартинка_ДанныеЭтикетки_ДопИнформация;	
	КонецЕсли;
	
	Если Значение = "data" Тогда
		ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_Дата.Картинка = мКартинка_ДанныеЭтикетки_Дата;	
	КонецЕсли;
	
	Если Значение = "ExpiredDate" Тогда 
		ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_СрокГодности.Картинка = мКартинка_ДанныеЭтикетки_СрокГодности;	
	КонецЕсли;
	
	Если Значение = "oldPrice" Тогда
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_СтараяЦена.Картинка = мКартинка_ДанныеЭтикетки_СтараяЦена;	
	КонецЕсли;
	
	Если Значение = "sellerName" Тогда
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ИмяПродавца.Картинка = мКартинка_ДанныеЭтикетки_ИмяПродавца;	
	КонецЕсли;
	
	Если Значение = "sellerAddress" Тогда
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_АдресПродавца.Картинка = мКартинка_ДанныеЭтикетки_АдресПродавца;	
	КонецЕсли;
	
	Если Значение = "producerCountry" Тогда
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_СтранаПроизводства.Картинка = мКартинка_ДанныеЭтикетки_СтранаПроизводства;	
	КонецЕсли;
	
	Если Значение = "producerName" Тогда
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ИмяПроизводителя.Картинка = мКартинка_ДанныеЭтикетки_ИмяПроизводителя;	
	КонецЕсли;
	
	Если Значение = "supplierName" Тогда
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ИмяПоставщика.Картинка = мКартинка_ДанныеЭтикетки_ИмяПоставщика;	
	КонецЕсли;
	
	Если Значение = "supplierAddress" Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_АдресПоставщика.Картинка = мКартинка_ДанныеЭтикетки_АдресПоставщика;	
	КонецЕсли;

	//Если Значение = "marking" Тогда 
	//		ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_АртикулТовара.Картинка = мКартинка_ДанныеЭтикетки_АртикулТовара;	
	//КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьНастройкиВ_XML()
	
	ОбработкаОбъект.мНастройкиМобильнойПечати.Очистить();
	
	ОбработкаОбъект.мНастройкиМобильнойПечати.Добавить("ВидЭтикетки", "");
	
	Для каждого мСтрока Из ТабличноеПолеПоляЭтикетки Цикл	
		Если мСтрока.Использование = Ложь Тогда
			Продолжить;	
		КонецЕсли;
		
		ОбработкаОбъект.мНастройкиМобильнойПечати.Добавить(мСтрока.ПолеЭтикетки);
	КонецЦикла;
	
	ОбработкаОбъект.СохранитьНастройкиМобильнойПечати();
	
КонецПроцедуры

Процедура ТабличноеПолеПоляЭтикеткиПриИзмененииФлажка(Элемент, Колонка)
	
	Если Элемент.ТекущиеДанные.ПолеЭтикетки = "AdditionInfo" Тогда
		Если Элемент.ТекущиеДанные.Использование Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ДопИнформация.Картинка = мКартинка_ДанныеЭтикетки_ДопИнформация;	
		Иначе
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ДопИнформация.Картинка = мКартинкаПустая;	
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПолеЭтикетки = "data" Тогда
		Если Элемент.ТекущиеДанные.Использование Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_Дата.Картинка = мКартинка_ДанныеЭтикетки_Дата;	
		Иначе
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_Дата.Картинка = мКартинкаПустая;	
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПолеЭтикетки = "ExpiredDate" Тогда
		Если Элемент.ТекущиеДанные.Использование Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_СрокГодности.Картинка = мКартинка_ДанныеЭтикетки_СрокГодности;	
		Иначе
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_СрокГодности.Картинка = мКартинкаПустая;	
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПолеЭтикетки = "oldPrice" Тогда
		Если Элемент.ТекущиеДанные.Использование Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_СтараяЦена.Картинка = мКартинка_ДанныеЭтикетки_СтараяЦена;	
		Иначе
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_СтараяЦена.Картинка = мКартинкаПустая;	
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПолеЭтикетки = "sellerName" Тогда
		Если Элемент.ТекущиеДанные.Использование Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ИмяПродавца.Картинка = мКартинка_ДанныеЭтикетки_ИмяПродавца;	
		Иначе
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ИмяПродавца.Картинка = мКартинкаПустая;	
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПолеЭтикетки = "sellerAddress" Тогда
		Если Элемент.ТекущиеДанные.Использование Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_АдресПродавца.Картинка = мКартинка_ДанныеЭтикетки_АдресПродавца;	
		Иначе
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_АдресПродавца.Картинка = мКартинкаПустая;	
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПолеЭтикетки = "producerCountry" Тогда
		Если Элемент.ТекущиеДанные.Использование Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_СтранаПроизводства.Картинка = мКартинка_ДанныеЭтикетки_СтранаПроизводства;	
		Иначе
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_СтранаПроизводства.Картинка = мКартинкаПустая;	
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПолеЭтикетки = "producerName" Тогда
		Если Элемент.ТекущиеДанные.Использование Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ИмяПроизводителя.Картинка = мКартинка_ДанныеЭтикетки_ИмяПроизводителя;	
		Иначе
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ИмяПроизводителя.Картинка = мКартинкаПустая;	
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПолеЭтикетки = "supplierName" Тогда
		Если Элемент.ТекущиеДанные.Использование Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ИмяПоставщика.Картинка = мКартинка_ДанныеЭтикетки_ИмяПоставщика;	
		Иначе
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_ИмяПоставщика.Картинка = мКартинкаПустая;	
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПолеЭтикетки = "supplierAddress" Тогда
		Если Элемент.ТекущиеДанные.Использование Тогда 
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_АдресПоставщика.Картинка = мКартинка_ДанныеЭтикетки_АдресПоставщика;	
		Иначе
			ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_АдресПоставщика.Картинка = мКартинкаПустая;	
		КонецЕсли;
	КонецЕсли;

	//Если Элемент.ТекущиеДанные.ПолеЭтикетки = "marking" Тогда
	//	Если Элемент.ТекущиеДанные.Использование Тогда 
	//		ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_АртикулТовара.Картинка = мКартинка_ДанныеЭтикетки_АртикулТовара;	
	//	Иначе
	//		ЭлементыФормы.ПолеГрафическойСхемыЭтикетки.ЭлементыГрафическойСхемы.Декорация_АртикулТовара.Картинка = мКартинкаПустая;	
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры
	

