// Процедура - Отправить письмо с уведомлением о работе выгрузки
//
// Параметры:
//  ПолучательПисем	 - Строка	 - адрес, на который отпрвлять уведомление
//  ЗаголовокПисьма	 - Строка	 - заголовок письма-уведомления
//  ТелоПисьма		 - Строка	 - содержание письма
//
Процедура ОтправитьПисьмо(ПолучательПисем,ЗаголовокПисьма,ТелоПисьма) 

	УчетныеЗаписи = Новый Массив;
	УчетныеЗаписи.Добавить(Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("1С").Ссылка);
	Письма = Новый Соответствие;
	СтруктураПисьма = Новый Структура;
	СтруктураПисьма.Вставить("Тема"         , ЗаголовокПисьма);
	СтруктураПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоКоду("000000001"));
	Отбой=Символы.ПС+Символы.ВК;
	ТекстПисьма=Новый ТекстовыйДокумент;
	ТекстПисьма.ДобавитьСтроку(ТелоПисьма);
	ТекстПисьма.ДобавитьСтроку("Начало выгрузки:");
	ТекстПисьма.ДобавитьСтроку(Формат(ТекущаяДата(),"ДЛФ=DDT"));
	СтруктураПисьма.Вставить("Тело"      , ТекстПисьма.ПолучитьТекст());
	
	СписокКому = Новый СписокЗначений;
	СписокКому.Добавить(ПолучательПисем,"Ответственный");
	СтруктураПисьма.Вставить("Кому", СписокКому);
	
	Письмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(Справочники.Пользователи.НайтиПоКоду("Регламент"), СтруктураПисьма,,, Истина, "Ответ", ,,ложь);
	Если ЗначениеЗаполнено(Письмо) Тогда
		ОбъектПисьмо = Письмо.ПисьмоСсылка.ПолучитьОбъект();
		ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
		ОбъектПисьмо.Записать();
		
		Если Не ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
			ОбъектПисьмо.Ответственный = Справочники.Пользователи.НайтиПоКоду("Регламент");
		КонецЕсли; 
		
		Письма.Вставить(Письмо.ПисьмоСсылка, ОбъектПисьмо);
		УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(Неопределено, Справочники.Пользователи.НайтиПоКоду("Регламент"), УчетныеЗаписи, Письма, Истина,Ложь,Ложь);
	КонецЕсли;
	

КонецПроцедуры

Функция ПоддерживаетсяВидТО(Вид) Экспорт

	Результат = Ложь;

	Если Вид = Перечисления.ВидыТорговогоОборудования.ККМOffLine Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;

КонецФункции // Поддержив



Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриОткрытии()
	ПолучитьСерверТО().ПодключитьКлиента(ЭтаФорма);
	Отбой=Символы.ПС+Символы.ВК;
	
#Область Наши_магазины	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТорговоеОборудование.Идентификатор,
		|	ТорговоеОборудование.КассаККМ,
		|	ДанныеДляВыгрузкиНаКассы.ДанныеДляВыгрузки,
		|	ТорговоеОборудование.Параметры
		|ИЗ
		|	РегистрСведений.ТорговоеОборудование КАК ТорговоеОборудование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляВыгрузкиНаКассы КАК ДанныеДляВыгрузкиНаКассы
		|		ПО ТорговоеОборудование.КассаККМ = ДанныеДляВыгрузкиНаКассы.КассаККМ
		|ГДЕ
		|	ТорговоеОборудование.Подключено
		|	И ТорговоеОборудование.Компьютер = &Компьютер
		|	И ДанныеДляВыгрузкиНаКассы.КассаККМ.Склад В ИЕРАРХИИ(&Магазины)";
	
	Запрос.УстановитьПараметр("Компьютер", ПолучитьСерверТО().ПолучитьИмяКомпьютераТО());
	Запрос.УстановитьПараметр("Магазины", Справочники.Склады.НайтиПоКоду("000000103"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокКому = Новый СписокЗначений;
	СписокКому.Добавить("zua@pivzavoz.ru","Юлия Анатольевна");
	Если Не РезультатЗапроса.Пустой() Тогда
		//0. Отправим письмо Юлии
		ТекстПисьма=Новый ТекстовыйДокумент;
		ТекстПисьма.ДобавитьСтроку("Начало выгрузки:");
		ТекстПисьма.ДобавитьСтроку(Формат(ТекущаяДата(),"ДЛФ=DDT"));
		УправлениеЭлектроннойПочтой.ОтправитьПисьмоОтСистемы("Начало выгрузки в кассы",ТекстПисьма.ПолучитьТекст(),СписокКому);
		
		Выборка=РезультатЗапроса.Выбрать();
		Набор=РегистрыСведений.ДанныеДляВыгрузкиНаКассы.СоздатьНаборЗаписей();
		Пока Выборка.Следующий() Цикл
			ДанныеДляВыгрузки=Выборка.ДанныеДляВыгрузки.Получить();
			Обработка = Неопределено;
			Объект    = Неопределено;
			ПолучитьСерверТО().ПолучитьОбъектДрайвера(Выборка.Идентификатор,Обработка,Объект);
			ПолучитьСерверТО().ВыгрузитьТоварыККМ(Выборка.Идентификатор, ДанныеДляВыгрузки);
			//Вложим файл отправленный на кассу
			ПутьДоФайла=Объект.Параметры.БазаТоваров;
			СписокФайловВложений = Новый СписокЗначений;
			Файл = Новый Файл(ПутьДоФайла);
			Если Файл.Существует() Тогда
				Данные = Новый ДвоичныеДанные(ПутьДоФайла );
			КонецЕсли;
			СписокФайловВложений.Добавить(Новый Структура("Хранилище, ИмяФайла, Наименование", Данные, "goods.txt", "Файл"));
			
			
			УправлениеЭлектроннойПочтой.ОтправитьПисьмоОтСистемы("Выгружаем кассу "+Строка(Выборка.КассаККМ),"",СписокКому);
			
			Набор.Отбор.КассаККМ.Установить(Выборка.КассаККМ);
			Набор.Прочитать();
			Набор.Очистить();
			Набор.Записать();
		КонецЦикла;
		
		//0. Отправим письмо Юлии
		ТекстПисьма=Новый ТекстовыйДокумент;
		ТекстПисьма.ДобавитьСтроку("Конец выгрузки:");
		ТекстПисьма.ДобавитьСтроку(Формат(ТекущаяДата(),"ДЛФ=DDT"));		
		УправлениеЭлектроннойПочтой.ОтправитьПисьмоОтСистемы("Конец выгрузки в кассы",ТекстПисьма.ПолучитьТекст(),СписокКому);
	КонецЕсли;
#КонецОбласти	
	

#Область Франшиза	
	Запрос.УстановитьПараметр("Магазины", Справочники.Склады.НайтиПоКоду("000000104"));
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокКому = Новый СписокЗначений;
	СписокКому.Добавить("pna@pivko66.ru","Наталья Анатольевна");
	Если Не РезультатЗапроса.Пустой() Тогда
		ТекстПисьма=Новый ТекстовыйДокумент;
		ТекстПисьма.ДобавитьСтроку("Начало выгрузки:");
		ТекстПисьма.ДобавитьСтроку(Формат(ТекущаяДата(),"ДЛФ=DDT"));
		УправлениеЭлектроннойПочтой.ОтправитьПисьмоОтСистемы("Начало выгрузки в кассы",ТекстПисьма.ПолучитьТекст(),СписокКому);
		
		Выборка=РезультатЗапроса.Выбрать();
		Набор=РегистрыСведений.ДанныеДляВыгрузкиНаКассы.СоздатьНаборЗаписей();
		Пока Выборка.Следующий() Цикл
			ДанныеДляВыгрузки=Выборка.ДанныеДляВыгрузки.Получить();
			ПолучитьСерверТО().ВыгрузитьТоварыККМ(Выборка.Идентификатор, ДанныеДляВыгрузки);
			
			УправлениеЭлектроннойПочтой.ОтправитьПисьмоОтСистемы("Выгружаем кассу "+Строка(Выборка.КассаККМ),"",СписокКому);
			
			Набор.Отбор.КассаККМ.Установить(Выборка.КассаККМ);
			Набор.Прочитать();
			Набор.Очистить();
			Набор.Записать();
		КонецЦикла;
		
		//0. Отправим письмо Юлии
		ТекстПисьма=Новый ТекстовыйДокумент;
		ТекстПисьма.ДобавитьСтроку("Конец выгрузки:");
		ТекстПисьма.ДобавитьСтроку(Формат(ТекущаяДата(),"ДЛФ=DDT"));		
		УправлениеЭлектроннойПочтой.ОтправитьПисьмоОтСистемы("Конец выгрузки в кассы",ТекстПисьма.ПолучитьТекст(),СписокКому);
	КонецЕсли;
#КонецОбласти	

	//4. Завершить работу
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры
