
Процедура КнопкаВыполнитьНажатие(Кнопка)
	//1. Формируем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
		|	ПоступлениеТоваровУслуг.Номер КАК Номер,
		|	ПоступлениеТоваровУслуг.Дата КАК Дата,
		|	ПоступлениеТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
		|	ПоступлениеТоваровУслугТовары.Номенклатура,
		|	ПоступлениеТоваровУслугТовары.Номенклатура.Код КАК КодНоменклатуры,
		|	ПоступлениеТоваровУслугТовары.ДатаРозлива
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ПО ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслуг.Ссылка
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете
		|	И ПоступлениеТоваровУслуг.Проведен
		|	И ПоступлениеТоваровУслугТовары.ДатаРозлива <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ДатаКон", Дата(2016,05,31,23,59,59));
	Запрос.УстановитьПараметр("ДатаНач", Дата(2016,05,01,00,00,00));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаписьXML = Новый ЗаписьXML();
    ЗаписьXML.УстановитьСтроку();
    СериализаторXDTO.ЗаписатьXML(ЗаписьXML, РезультатЗапроса.Выгрузить());
    СтрокаXML = ЗаписьXML.Закрыть();
	ЗаписьТекста=Новый ЗаписьТекста(Путь);
	ЗаписьТекста.Записать(СтрокаXML);
	ЗаписьТекста.Закрыть();
	
КонецПроцедуры
