	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК Серия,
		|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры.Владелец КАК Номенклатура,
		|	ПоступлениеТоваровУслугТовары.Ссылка КАК ДокПоступления,
		|	ЕГАИС_ТТН_вхТовары.СПР_А,
		|	ЕГАИС_ТТН_вхТовары.КодАП_ЕГАИС,
		|	ЕГАИС_СПРА.ДатаРозлива
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЕГАИС_ТТН_вх.Товары КАК ЕГАИС_ТТН_вхТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЕГАИС_СПРА КАК ЕГАИС_СПРА
		|			ПО ЕГАИС_ТТН_вхТовары.КодАП_ЕГАИС = ЕГАИС_СПРА.AlcCode
		|				И ЕГАИС_ТТН_вхТовары.СПР_А = ЕГАИС_СПРА.СПР_А
		|		ПО ПоступлениеТоваровУслугТовары.Ссылка = ЕГАИС_ТТН_вхТовары.Ссылка.УчетныйДокумент
		|			И ПоступлениеТоваровУслугТовары.Номенклатура = ЕГАИС_ТТН_вхТовары.СпрНоменклатура
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры.ДатаРозлива = ДАТАВРЕМЯ(1, 1, 1)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Об=ВыборкаДетальныеЗаписи.Серия.ПолучитьОбъект();
		Об.ДатаРозлива=ВыборкаДетальныеЗаписи.ДатаРозлива;
		Об.Записать();
	КонецЦикла;
