	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТоваров.СерияНоменклатуры КАК Серия,
		|	ТаблицаТоваров.СерияНоменклатуры.Владелец КАК Номенклатура,
		|	ТаблицаТоваров.Ссылка КАК ДокПоступления,
		|	ЕГАИС_ТТН_вхТовары.СПР_А,
		|	ЕГАИС_ТТН_вхТовары.КодАП_ЕГАИС,
		|	ВЫБОР
		|		КОГДА ЕГАИС_СПРА.ДатаРозлива = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ЕГАИС_СПРА.ТТНДата
		|		ИНАЧЕ ЕГАИС_СПРА.ДатаРозлива
		|	КОНЕЦ КАК ДатаРозлива
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
		|		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|		ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры
		|	ИЗ
		|		Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПеремещениеТоваровТовары.Ссылка,
		|		ПеремещениеТоваровТовары.Номенклатура,
		|		ПеремещениеТоваровТовары.СерияНоменклатуры
		|	ИЗ
		|		Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары) КАК ТаблицаТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЕГАИС_ТТН_вх.Товары КАК ЕГАИС_ТТН_вхТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЕГАИС_СПРА КАК ЕГАИС_СПРА
		|			ПО ЕГАИС_ТТН_вхТовары.КодАП_ЕГАИС = ЕГАИС_СПРА.AlcCode
		|				И ЕГАИС_ТТН_вхТовары.СПР_А = ЕГАИС_СПРА.СПР_А
		|		ПО ТаблицаТоваров.Ссылка = ЕГАИС_ТТН_вхТовары.Ссылка.УчетныйДокумент
		|			И ТаблицаТоваров.Номенклатура = ЕГАИС_ТТН_вхТовары.СпрНоменклатура
		|ГДЕ
		|	ТаблицаТоваров.СерияНоменклатуры.ДатаРозлива = ДАТАВРЕМЯ(1, 1, 1)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Об=ВыборкаДетальныеЗаписи.Серия.ПолучитьОбъект();
		Об.ДатаРозлива=ВыборкаДетальныеЗаписи.ДатаРозлива;
		Об.Записать();
	КонецЦикла;
