Перем МакетСправки экспорт;

Процедура ПриОткрытии()
	
	ОбновитьДанные();
	
КонецПроцедуры

Функция ПолучитьПапкуСФайламиПомощи(ПутьКОбработке)
	
 	МассивПапок = РазложитьСтрокуВМассивПодстрок_(ПутьКОбработке,"\");
	
	сч = МассивПапок.количество()-2;
	ТекущаяПапкаОбработки = "";
	Пока сч >= 0 цикл
		ПапкаПутиКОбработки    = МассивПапок[сч];
		ТекущаяПапкаОбработки  = ПапкаПутиКОбработки +"\"+ ТекущаяПапкаОбработки;
		сч = сч - 1;
	КонецЦикла;
	
	сч = МассивПапок.количество()-3;
	ПапкаПомощи = "";
	Пока сч >= 0 цикл
		ПапкаПутиКОбработки    = МассивПапок[сч];
		ПапкаПомощи  = ПапкаПутиКОбработки +"\"+ ПапкаПомощи;
		сч = сч - 1;
	КонецЦикла;
	
	ПапкаПомощи = ПапкаПомощи + "Файлы помощи обработок\";
	
	Возврат Новый Структура("ПапкаПомощи,ТекущаяПапкаОбработки",ПапкаПомощи,ТекущаяПапкаОбработки);
	
КонецФункции	
 
Процедура ОбновитьДанные() Экспорт
	
	ПутьКТекущейОбработке = этотОбъект.ИспользуемоеИмяФайла;
	ПапкиПомощи = ПолучитьПапкуСФайламиПомощи(ПутьКТекущейОбработке);
	
	ИмяФайла = ПапкиПомощи.ТекущаяПапкаОбработки+МакетСправки;
	ФайлМакета=Новый Файл(ИмяФайла);
	Если ФайлМакета.Существует() Тогда
        ЭлементыФормы.ПолеHTML.Перейти(ИмяФайла);
		Возврат
	КонецЕсли;
	
	ИмяФайла = ПапкиПомощи.ПапкаПомощи+МакетСправки;
	ФайлМакета=Новый Файл(ИмяФайла);
	Если ФайлМакета.Существует() Тогда
		ЭлементыФормы.ПолеHTML.Перейти(ИмяФайла);
		Возврат;
	КонецЕсли;
	
	ЭлементыФормы.ПолеHTML.УстановитьТекст("Файл справки не обнаружен. Проверьте наличие файла """+МакетСправки+""" в каталоге обработки:"""+ПапкиПомощи.ТекущаяПапкаОбработки+"""");
	  
КонецПроцедуры

Процедура ОсновныеДействияФормыПечать(Кнопка)
	
	 Элементыформы.ПолеHTML.Документ.parentWindow.print();
	 
КонецПроцедуры
