
//ОСНОВНЫЕ ДЕЙСТВИЯ ФОРМЫ

Процедура КнопкаВыполнитьНажатие(Кнопка)
	МассивOffline = ПолучитьСерверТО().ПолучитьСписокУстройств(Перечисления.ВидыТорговогоОборудования.ККМOffLine, КассаККМ);
	Для Каждого ККМ Из МассивOffline Цикл
		Обработка = Неопределено;
		Объект    = Неопределено;
		Результат = ПолучитьСерверТО().ПолучитьОбъектДрайвера(ККМ, Обработка, Объект);
		мТекКассаККМ = ПолучитьКассуККМПоИдентификатору(ККМ);
		
		Файл = Новый Файл(Объект.Параметры.ФайлОтчета);
		Если Не Файл.Существует() Тогда
			ЗаписьТемп=ДобавитьЗаписьВЛог(КассаККМ,СтатусыОшибок.ФайлОтсутствует,"Нет файла отчета");
			Состояние("Пытаемся получить данные с кассы. Для отмены нажмите Ctrl+Break");
			Если ПоследняяСмена Тогда
				ЗапроситьОтчетПоследнейСмены(Файл.Путь+"upload.flz");
			ИначеЕсли ЗначениеЗаполнено(НачДата) или ЗначениеЗаполнено(КонДата) Тогда
				ЗапроситьОтчетЗаПериод(Файл.Путь+"upload.flz");
			ИначеЕсли ЗначениеЗаполнено(НачСмена) или ЗначениеЗаполнено(КонСмена) Тогда
				ЗапроситьОтчетЗаСмены(Файл.Путь+"upload.flz");
			Иначе
				ЗапроситьОтчетПоследнейСмены(Файл.Путь+"upload.flz");
			КонецЕсли;
			ФайлФлаг=Новый Файл(Файл.Путь+"upload.flz");
			Пока ФайлФлаг.Существует() Цикл
				ОбработкаПрерыванияПользователя();
			КонецЦикла;
			Состояние("");
			Для Индекс=1 По 10 Цикл
				Сообщить("Ожидание ответа кассы в " +ТекущаяДата()+"...");
				Если Файл.Существует() Тогда
					Прервать;
				Иначе
					Пауза(5);
				КонецЕсли;
			КонецЦикла;
			Если Файл.Существует() Тогда
				ДобавитьЗаписьВЛог(КассаККМ,СтатусыОшибок.Успешно,"Файл отчета получен с кассы");
				ОбработкаЧековOffline(ККМ);
			Иначе
				ДобавитьЗаписьВЛог(КассаККМ,СтатусыОшибок.ФайлОтсутствует,"Не удалось получить файл");
			КонецЕсли;
		Иначе
			Сообщить("Обнаружен незагруженный файл отчета, если он уже был загружен удалите вручную! "+Файл.ПолноеИмя);
			ОбработкаЧековOffline(ККМ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОсновныеДействияФормыЗагрузитьВсеКассы(Кнопка)
	Регламент(Ложь,"TERMINAL");
КонецПроцедуры

Процедура ПриОткрытии()
	ПолучитьСерверТО().ПодключитьКлиента(ЭтаФорма);
КонецПроцедуры

Процедура ПриЗакрытии()
	ПолучитьСерверТО().ОтключитьКлиента(ЭтаФорма);
КонецПроцедуры // ПриЗакрытии()

//ОБРАБОТКИ СОБЫТИЙ ФОРМЫ

Процедура ВыбПериодНажатие(Элемент)

	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачДата, ?(КонДата='0001-01-01', КонДата, КонецДня(КонДата)));
	Если НастройкаПериода.Редактировать() Тогда
		НачДата = НастройкаПериода.ПолучитьДатуНачала();
		КонДата = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;

КонецПроцедуры

Процедура КассаККМПриИзменении(Элемент)
	Склад = КассаККМ.Склад;
КонецПроцедуры

Процедура ПоследняяСменаПриИзменении(Элемент)
	ЭлементыФормы.НачДата.Доступность	=Не ПоследняяСмена;
	ЭлементыФормы.НачСмена.Доступность	=Не ПоследняяСмена;
	ЭлементыФормы.КонДата.Доступность	=Не ПоследняяСмена;
	ЭлементыФормы.КонСмена.Доступность	=Не ПоследняяСмена;
КонецПроцедуры

Процедура ОсновныеДействияФормыгагага(Кнопка)
	мАвтоРежим=Истина;
	Регламент(Истина,"TERMINAL");
КонецПроцедуры
