
&НаСервере
Процедура ЗагрузитьНаСервере()
	ЧтениеXML=Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Объект.Путь);
	
	ТЗ=СериализаторXDTO.ПрочитатьXML(ЧтениеXML,Тип("ТаблицаЗначений"));
	
	Для Каждого СтрокаТЧ Из ТЗ Цикл
		Ном=Справочники.Номенклатура.НайтиПоКоду(СтрокаТЧ.КодВладелец);
		Если ЗначениеЗаполнено(Ном) Тогда
			//1. Устанавливаем индивидуальный набор упаковок
			Если Ном.НаборУпаковок<>Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры Тогда
				Об=Ном.ПолучитьОбъект();
				Об.НаборУпаковок=Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры;
				Об.Записать();
			КонецЕсли;
			
			//2. Ищем на всякий случай ед измерения
			ЕдИзм=Справочники.УпаковкиНоменклатуры.НайтиПоНаименованию(СтрокаТЧ.Наименование,ложь,,Ном);
			Если Не ЗначениеЗаполнено(ЕдИзм) Тогда
				ЕдИзмОб=Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
				ЕдИзмОб.Владелец=Ном;
				ЕдИзмОб.Наименование=СтрокаТЧ.Наименование;
				ЕдИзмОб.Вес=СтрокаТЧ.Вес;
				ЕдИзмОб.Объем=СтрокаТЧ.Объем;
				ЕдИзмОб.ЕдиницаИзмерения=Справочники.БазовыеЕдиницыИзмерения.НайтиПоНаименованию(СтрокаТЧ.Наименование,Ложь);
				ЕдИзмОб.Коэффициент=СтрокаТЧ.Коэффициент;
				ЕдИзмОб.Записать();
				ЕдИзм=ЕдИзмОб.Ссылка;
			КонецЕсли;
			
			//3. Заполняем реквизит
			Если Не ЗначениеЗаполнено(ном.ЕдиницаИзмеренияМест) Тогда
				Об=Ном.ПолучитьОбъект();
				Об.ЕдиницаИзмеренияМест=ЕдИзм;
				Об.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
