
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриОткрытии()
	//1. Открываем внеш. обработку
	Об=Справочники.ВнешниеОбработки.НайтиПоКоду("000000240").ХранилищеВнешнейОбработки.Получить();
	ТемпФайл=ПолучитьИмяВременногоФайла();
	Об.Записать(ТемпФайл);
	ВнОбработка=ВнешниеОбработки.Создать(ТемпФайл);
	
	//2. Открываем форму
	Форма=ВнОбработка.ПолучитьФорму();
	Форма.Открыть();
	
	//3. Выполняем код
	Форма.АвтоВыгрузка();
	
	//4. Завершить работу
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры
