
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ВыгрузитьАнкетуВXML(СсылкаНаОбъект);
КонецПроцедуры

Функция ВыгрузитьАнкетуВXML(Анкета)
	XML=Новый ЗаписьXML;
	XML.ОткрытьФайл(ПутьСохранения);
	XML.ЗаписатьОбъявлениеXML();
	
	XML.ЗаписатьНачалоЭлемента("Anketa");
		XML.ЗаписатьНачалоЭлемента("Page");
			XML.ЗаписатьАтрибут("ColCount","3");
			СчРазделов=0;
			Выборка=Справочники.РазделыАнкеты.Выбрать(,Анкета);
			Пока Выборка.Следующий() Цикл
				СчРазделов=СчРазделов+1;
			КонецЦикла;
			СчВопросов=Анкета.ВопросыАнкеты.Количество();
			xml.ЗаписатьАтрибут("RowCount",Формат(СчВопросов+СчРазделов,"ЧРГ="));
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТиповыеАнкетыВопросыАнкеты.Раздел КАК Раздел,
		|	ТиповыеАнкетыВопросыАнкеты.Вопрос
		|ИЗ
		|	Справочник.ТиповыеАнкеты.ВопросыАнкеты КАК ТиповыеАнкетыВопросыАнкеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТиповыеАнкеты КАК ТиповыеАнкеты
		|		ПО ТиповыеАнкетыВопросыАнкеты.Ссылка = ТиповыеАнкеты.Ссылка
		|ГДЕ
		|	ТиповыеАнкеты.Ссылка = &Анкета
		|ИТОГИ ПО
		|	Раздел";
	
	Запрос.УстановитьПараметр("Анкета", Анкета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРаздел = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Сч=1;
	Пока ВыборкаРаздел.Следующий() Цикл
		XML.ЗаписатьНачалоЭлемента("Row");
			XML.ЗаписатьАтрибут("Height","22");
			XML.ЗаписатьНачалоЭлемента("Cell");
				XML.ЗаписатьАтрибут("Width","20");
				XML.ЗаписатьАтрибут("Text","");
			XML.ЗаписатьКонецЭлемента();
			XML.ЗаписатьНачалоЭлемента("Cell");
				XML.ЗаписатьАтрибут("Width","265");
				XML.ЗаписатьАтрибут("Text",ВыборкаРаздел.Раздел.Наименование);
				XML.ЗаписатьАтрибут("FontStyle","Bold");
				XML.ЗаписатьАтрибут("FontSize","8.25");
				XML.ЗаписатьАтрибут("FontFamily","GenericSansSerif");
			XML.ЗаписатьКонецЭлемента();
			XML.ЗаписатьНачалоЭлемента("Cell");
				XML.ЗаписатьАтрибут("Width","49");
				XML.ЗаписатьАтрибут("Text","");
			XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьКонецЭлемента();
		ВыборкаДетальныеЗаписи = ВыборкаРаздел.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			XML.ЗаписатьНачалоЭлемента("Row");
				XML.ЗаписатьАтрибут("Height","22");
				XML.ЗаписатьНачалоЭлемента("Cell");
					XML.ЗаписатьАтрибут("Text",Строка(Сч));
				XML.ЗаписатьКонецЭлемента();
				XML.ЗаписатьНачалоЭлемента("Cell");
					XML.ЗаписатьАтрибут("Text",СокрЛП(ВыборкаДетальныеЗаписи.Вопрос.ПолнаяФормулировка));
				XML.ЗаписатьКонецЭлемента();
				XML.ЗаписатьНачалоЭлемента("Cell");
					XML.ЗаписатьАтрибут("Text","");
					XML.ЗаписатьАтрибут("ControlType","CheckBox");
					XML.ЗаписатьАтрибут("Id",ВыборкаДетальныеЗаписи.Вопрос.Наименование);
				XML.ЗаписатьКонецЭлемента();
			XML.ЗаписатьКонецЭлемента();
			Сч=Сч+1;
		КонецЦикла;
	КонецЦикла;
	XML.ЗаписатьКонецЭлемента();
	XML.ЗаписатьКонецЭлемента();
	XML.Закрыть();
	Возврат Истина;
КонецФункции