
#Область Вспомогательные_процедуры_и_функции
Функция РассчетОбъема(Номенклатура)
	Объем=0;
	Если Номенклатура.Комплект Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СУММА(КомплектующиеНоменклатуры.ЕдиницаИзмерения.Объем * КомплектующиеНоменклатуры.Количество) КАК Объем
		|ИЗ
		|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
		|ГДЕ
		|	КомплектующиеНоменклатуры.Номенклатура = &Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Рез=Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Объем=0;
		Иначе
			Объем=Рез.Выгрузить()[0].Объем;
		КонецЕсли;
	Иначе
		Объем=Номенклатура.ЕдиницаХраненияОстатков.Объем;
	КонецЕсли;
	Возврат Объем;
КонецФункции
#КонецОбласти


// Процедура - Отправить письмо с уведомлением о работе выгрузки
//
// Параметры:
//  ПолучательПисем	 - Строка	 - адрес, на который отпрвлять уведомление
//  ЗаголовокПисьма	 - Строка	 - заголовок письма-уведомления
//  ТелоПисьма		 - Строка	 - содержание письма
//
Процедура ОтправитьПисьмо(ПолучательПисем,ЗаголовокПисьма,ТелоПисьма) Экспорт

	УчетныеЗаписи = Новый Массив;
	УчетныеЗаписи.Добавить(Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("1С").Ссылка);
	Письма = Новый Соответствие;
	СтруктураПисьма = Новый Структура;
	СтруктураПисьма.Вставить("Тема"         , ЗаголовокПисьма);
	СтруктураПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоКоду("000000001"));
	Отбой=Символы.ПС+Символы.ВК;
	ТекстПисьма=Новый ТекстовыйДокумент;
	ТекстПисьма.ДобавитьСтроку(ТелоПисьма);
	ТекстПисьма.ДобавитьСтроку("Начало выгрузки:");
	ТекстПисьма.ДобавитьСтроку(Формат(ТекущаяДата(),"ДЛФ=DDT"));
	СтруктураПисьма.Вставить("Тело"      , ТекстПисьма.ПолучитьТекст());
	СписокКому = Новый СписокЗначений;
	СписокКому.Добавить(ПолучательПисем,"Ответственный");
	СтруктураПисьма.Вставить("Кому", СписокКому);
	Письмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(Справочники.Пользователи.НайтиПоКоду("Регламент"), СтруктураПисьма,,, Истина, "Ответ", ,,ложь);
	Если ЗначениеЗаполнено(Письмо) Тогда
		ОбъектПисьмо = Письмо.ПисьмоСсылка.ПолучитьОбъект();
		ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
		ОбъектПисьмо.Записать();
		
		Если Не ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
			ОбъектПисьмо.Ответственный = Справочники.Пользователи.НайтиПоКоду("Регламент");
		КонецЕсли; 
		
		Письма.Вставить(Письмо.ПисьмоСсылка, ОбъектПисьмо);
		УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(Неопределено, Справочники.Пользователи.НайтиПоКоду("Регламент"), УчетныеЗаписи, Письма, Истина,Ложь,Ложь);
	КонецЕсли;
	

КонецПроцедуры

