Функция НадоЛиРегистрироватьДокумент(ДокументПродажи)
	//Работает только с ГАРЦ
	Если НЕ ДокументПродажи.Организация=Справочники.ИТИКонстанты.ОргГарц.Указатель Тогда
		Возврат Ложь;
	КонецЕсли;
	//Работаем только с БУ
	Если Не ДокументПродажи.ОтражатьВБухгалтерскомУчете Тогда
		Возврат Ложь;
	КонецЕсли;
	//Контакт по ЕГАИС
	//Сначала из грузополучателя
	Телефон=УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(ДокументПродажи.Грузополучатель,Справочники.ИТИКонстанты.КонтактЕГАИС.Указатель);
	Если Не ЗначениеЗаполнено(Телефон) Тогда
		//Если нет - то из контрагента
		Телефон=УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(ДокументПродажи.Контрагент,Справочники.ИТИКонстанты.КонтактЕГАИС.Указатель);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Телефон) Тогда
		Возврат Ложь;
	КонецЕсли;
	//Проверим что есть алкоголь
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслугТовары.Номенклатура
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Номенклатура В ИЕРАРХИИ(&Пиво)";
	Пиво=Новый СписокЗначений;
	Пиво.Добавить(Справочники.ИТИКонстанты.РазливноеПиво.Указатель);
	Пиво.Добавить(Справочники.ИТИКонстанты.ШтучноеПиво.Указатель);
	Запрос.УстановитьПараметр("Пиво", Пиво);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Процедура КнопкаВыполнитьНажатие(Кнопка)
	Сообщить(НадоЛиРегистрироватьДокумент(Документ));
КонецПроцедуры

Процедура ОсновныеДействияФормыДействие(Кнопка)
	Документ.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
