
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Код КАК КодВладелец,
		|	Номенклатура.ЕдиницаИзмеренияМест.Наименование КАК Наименование,
		|	Номенклатура.ЕдиницаИзмеренияМест.Вес КАК Вес,
		|	Номенклатура.ЕдиницаИзмеренияМест.Объем КАК Объем,
		|	Номенклатура.ЕдиницаИзмеренияМест.Коэффициент КАК Коэффициент
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ЕдиницаИзмеренияМест <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Таб=РезультатЗапроса.Выгрузить();
	
	ЗаписьXML = Новый ЗаписьXML();
    ЗаписьXML.УстановитьСтроку();
    СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Таб);
    СтрокаXML = ЗаписьXML.Закрыть();
	ЗаписьТекста=Новый ЗаписьТекста(Путь);
	ЗаписьТекста.Записать(СтрокаXML);
	ЗаписьТекста.Закрыть();
	
КонецПроцедуры
