
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ФайлЧтение=Новый ЧтениеТекста(ФайлОстатков);
	ДатаОст=Дата(ФайлЧтение.ПрочитатьСтроку());
	Орг=Справочники.ИТИКонстанты.ОргФИРМА.Указатель.Ссылка;
	ОтборОстОрг=Новый Структура("Организация,Номенклатура,Склад",Справочники.ИТИКонстанты.ОргФИРМА.Указатель.Ссылка);
	ОтборОстСкл=Новый Структура("Номенклатура,Склад");
	МассОрг=СписокОрганизаций.ВыгрузитьКолонку("Организация");
	
	Об=ДокументОткрытия.ПолучитьОбъект();
	Об.Дата=ДатаОст;
	Об.Комментарий="Выгрузка продаж";
	Если СписокОрганизаций.Количество() Тогда
		Сч=0;
		Набор=Об.Движения.ТоварыОрганизацийБУ;
		Набор.Прочитать();
		Пока Сч<Набор.Количество() Цикл
			ТекДвиж=Набор[Сч];
			Если МассОрг.Найти(ТекДвиж.Организация)=Неопределено Тогда
				Сч=Сч+1;
			Иначе
				Набор.Удалить(ТекДвиж);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Об.Движения.ТоварыОрганизацийБУ.Очистить();
	КонецЕсли;
	Об.Записать();
	
	Стр=ФайлЧтение.ПрочитатьСтроку();
	Пока Стр<>Неопределено цикл
		
		Масс=ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Стр,"	");
		Организация=Справочники.Организации.НайтиПоНаименованию(Масс[0]);
		Если СписокОрганизаций.Количество() и МассОрг.Найти(Организация) = Неопределено Тогда
			Стр=ФайлЧтение.ПрочитатьСтроку();
			Продолжить;
		КонецЕсли;
		Запись=Об.Движения.ТоварыОрганизацийБУ.ДобавитьРасход();
		Запись.Организация		= Организация;
		
		Запись.Номенклатура		= Справочники.Номенклатура.НайтиПоКоду(Масс[1]);
		Запись.Качество			= Справочники.Качество.Новый;
		Если Запись.Номенклатура.ВидНоменклатуры=Справочники.ИТИКонстанты.Пиво.Указатель Тогда
			Запись.Склад=Справочники.Склады.НайтиПоНаименованию(" Б-ИСТОК Склад №2",Истина).Ссылка;
		Иначе
			Запись.Склад=Справочники.Склады.НайтиПоНаименованию(" Основной",Истина).Ссылка;
		КонецЕсли;
		Запись.Квартал			= НачалоКвартала(ДатаОст);
		Запись.Количество		= Число(?(Масс[2]="",0,Масс[2]));
		Запись.Период			= ДатаОст;
		Запись.Регистратор		= Об.Ссылка;
		Стр=ФайлЧтение.ПрочитатьСтроку();
	КонецЦикла;
	
	Об.Движения.Записать();
КонецПроцедуры

Процедура ФайлОстатковНачалоВыбора(Элемент, СтандартнаяОбработка)
	Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр="Текст|*.txt";
	Если Диалог.Выбрать() Тогда
		ФайлОстатков=Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

Процедура ФайлПриоритетовНачалоВыбора(Элемент, СтандартнаяОбработка)
	Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр="Текст|*.txt";
	Если Диалог.Выбрать() Тогда
		ФайлПриоритетов=Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

Процедура ДокументОткрытияПриИзменении(Элемент)
	Если ДокументОткрытия.ТаблицаРегистровНакопления.Найти("ТоварыОрганизацийБУ")=Неопределено Тогда
		Сообщить("Этот документ не предназначен для корректировки БУ");
	КонецЕсли;
КонецПроцедуры

