
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
КонецПроцедуры

Процедура СоздатьДоговорыПоставокНажатие(Элемент)
	Отбор=Новый Структура("Контрагент");
	Набор=РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Таб=Набор.Выгрузить();
	Для Каждого СтрокаПродавцы Из Продавцы Цикл
		Организация=Таб.Найти(СтрокаПродавцы.Контрагент,"Контрагент").Организация;
		Для Каждого СтрокаПокупатели Из Покупатели Цикл
			Договор=Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			Договор.Владелец=СтрокаПокупатели.Контрагент;
			Договор.Организация=Организация;
			Договор.Наименование=Организация.Наименование +" продает "+СтрокаПокупатели.Контрагент.Наименование;
			Договор.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
			Форма=Договор.ПолучитьФорму();
			Форма.Открыть();
			Договор.Записать();
			Форма.Закрыть();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура СоздатьДоговорыЗакупокНажатие(Элемент)
	Набор=РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Таб=Набор.Выгрузить();
	Для Каждого СтрокаПокупатель Из Покупатели Цикл
		Организация=Таб.Найти(СтрокаПокупатель.Контрагент,"Контрагент").Организация;
		Для Каждого СтрокаПродавец Из Продавцы Цикл
			Договор=Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			Договор.Владелец=СтрокаПродавец.Контрагент;
			Договор.Организация=Организация;
			Договор.Наименование=Организация.Наименование +" покупает у "+СтрокаПродавец.Контрагент.Наименование;
			Договор.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
			Форма=Договор.ПолучитьФорму();
			Форма.Открыть();
			Договор.Записать();
			Форма.Закрыть();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
