Процедура ПриОткрытии()
	УстановитьОтборПоТипу("Документ");
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	ЭтаФорма.Закрыть("Выполнить");
КонецПроцедуры

Процедура УстановитьОтборПоТипу(Тип)

	ЭлементыФормы.СпособыСверткиОбъектовМетаданных.ОтборСтрок.ТипОбъектаМД.Установить(Тип);
	ЭлементыФормы.СпособыСверткиОбъектовМетаданных.НастройкаОтбораСтрок.ТипОбъектаМД.Доступность = Ложь;

КонецПроцедуры


Процедура ПанельНастройкиСпособовСверткиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	УстановитьОтборПоТипу(ЭлементыФормы.ПанельНастройкиСпособовСвертки.Страницы[ТекущаяСтраница].Имя);
КонецПроцедуры

Процедура ОсновныеДействияФормыФлажкиУстановить(Кнопка)
	ИзменитьФлажки(Истина);
КонецПроцедуры

Процедура ОсновныеДействияФормыФлажкиСнять(Кнопка)
	ИзменитьФлажки(Ложь);
КонецПроцедуры

Процедура ИзменитьФлажки(Флаг)

	ТипОбъекта = ЭлементыФормы.СпособыСверткиОбъектовМетаданных.ОтборСтрок.ТипОбъектаМД.Значение;
	Для Каждого Стр Из СпособыСверткиОбъектовМетаданных Цикл
		Если Стр.ТипОбъектаМД = ТипОбъекта Тогда
			Стр.Пометка = Флаг;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


