Перем мВыбор Экспорт;
Перем мОбъект Экспорт;
Перем мСписокДокументов Экспорт;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	Спис = Новый СписокЗначений;
	Для Каждого Строка из Документы Цикл
		Если ВсеДокументы = "ВсеДок" Тогда
			Спис.Добавить(Строка.ИдДокумента);
		Иначе
			Если Строка.Загружать = Истина Тогда
				Спис.Добавить(Строка.ИдДокумента);	
			КонецЕсли;    
		КонецЕсли;
	КонецЦикла;
	мСписокДокументов = Спис;	
	Закрыть(КодВозвратаДиалога.ОК);
КонецПроцедуры

Функция РазбитьСтр(Стр, РазбитьПо)
	Массив = Новый Массив;
	Пока СтрДлина(Стр) > 0 Цикл
		Инд = Найти(Стр, РазбитьПо);
		Если Инд > 0 Тогда
			Поле = СокрЛП(Лев(Стр, Инд-1));
			Массив.Добавить(Поле);
			Стр = Прав(Стр, СтрДлина(Стр)-Инд);
		Иначе
			Массив.Добавить(Стр);
			Прервать;
		КонецЕсли;		
	КонецЦикла;
 	Возврат Массив;
КонецФункции

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ВсеДокументы = мВыбор;
	Если мОбъект.Параметры.ТипСвязи = "Сервер" Тогда
		ЭлементыФормы.Документы.Колонки.Терминал.Видимость = Истина; 
		ЭлементыФормы.Документы.Колонки.ИдТерминала.Видимость = Истина;
		ЭлементыФормы.Документы.Колонки.IP.Видимость = Истина;
	Иначе
		ЭлементыФормы.Документы.Колонки.Терминал.Видимость = Ложь; 
		ЭлементыФормы.Документы.Колонки.ИдТерминала.Видимость = Ложь;
		ЭлементыФормы.Документы.Колонки.IP.Видимость = Ложь;
	КонецЕсли;
	
	Если мВыбор = "Документ" Тогда
		ЭлементыФормы.Документы.Доступность = Истина;
		ЭлементыФормы.КомандыДокументов.Доступность = Истина;
		
		СписДокументов = Новый СписокЗначений;
		Если мОбъект.Драйвер.ПолучитьСписокДокументов(мОбъект.ИдУстройства, СписДокументов) Тогда
			Для каждого ДокСтр из СписДокументов Цикл
				Массив = РазбитьСтр(ДокСтр, "|");
				ИмяТипаДокТСД = Массив[Массив.Количество()-1];
			
				Если ИмяТипаДокТСД = "1Спереоценка" Тогда
					Продолжить;
				КонецЕсли;
			
				Строка = Документы.Добавить();
				////Строка.Загружать = Истина;
				//	
				//Для инд = 0 По Массив.Количество()-1 Цикл
				//	Стр = Массив[инд];	
				//	Если инд+1 < Документы.Колонки.Количество() Тогда
				//		Строка.Установить(инд+1, Стр);
				//	КонецЕсли;
				//КонецЦикла;
				Строка.Документ    =  Массив[0];
				Строка.ИдДокумента =  Массив[1];
				Строка.Терминал    =  Массив[2];
				Строка.ИдТерминала =  Массив[3];
				Строка.IP          =  Массив[4];
				
				Спис = Новый СписокЗначений;
				Спис.Добавить(Строка.ИдДокумента);
				Docs = мОбъект.Драйвер.ПолучитьДокументы(Спис);
				Для Инд = 0 По Docs.Count()-1 Цикл
					ДокументТСД = Docs.Item(Инд);
					Строка.дата = ДокументТСД.ДатаСоздания;
				КонецЦикла;
			КонецЦикла;
		Иначе
			мОбъект.Драйвер.ПолучитьОшибку(мОбъект.ОписаниеОшибки);
			Сообщить("Не удалось получить список документов! Ошибка: " + мОбъект.ОписаниеОшибки);
		КонецЕсли;
		
		мОбъект.Драйвер.ОсвободитьРесурсы();
	Иначе
		ЭлементыФормы.Документы.Доступность = Ложь;
		ЭлементыФормы.КомандыДокументов.Доступность = Ложь;		
	КонецЕсли;
КонецПроцедуры

Процедура ОсновныеДействияФормыЗакрыть(Кнопка)
	Закрыть(КодВозвратаДиалога.Отмена);
КонецПроцедуры

Процедура КомандыДокументовВыделитьВсе(Кнопка)
	Документы.ЗаполнитьЗначения(Истина, "Загружать");
КонецПроцедуры

Процедура КомандыДокументовОчиститьВыделение(Кнопка)
	Документы.ЗаполнитьЗначения(Ложь, "Загружать");
КонецПроцедуры

Процедура ВыборЗагрузкиПриИзменении(Элемент)	
	Если ВсеДокументы = "Документ" Тогда
		ЭлементыФормы.Документы.Доступность = Истина;
		ЭлементыФормы.КомандыДокументов.Доступность = Истина;
	Иначе
		ЭлементыФормы.Документы.Доступность = Ложь;
		ЭлементыФормы.КомандыДокументов.Доступность = Ложь;		
	КонецЕсли;
КонецПроцедуры

Процедура Сортировать(Кнопка)
	
	Попытка
		ПоследнийСимвол = Число(Прав(Кнопка.Имя,1));
		НазваниеКолонки = Лев(Кнопка.Имя,СтрДлина(Кнопка.Имя)-1);
	исключение
		НазваниеКолонки = Кнопка.Имя;
	КонецПопытки;
	ПоВозрастанию = найти (Кнопка.Текст,"возр") > 0;
	
	Документы.Сортировать(НазваниеКолонки+" "+?(ПоВозрастанию,"возр","убыв"));
	
	ТекстМеню = ЭлементыФормы.КомандыДокументов.Кнопки.СортировкаКолонок.Текст;
	ЭлементыФормы.КомандыДокументов.Кнопки.СортировкаКолонок.Текст = ЛЕв(ТекстМеню,21) +":"+ НазваниеКолонки+", "+ ?(ПоВозрастанию,"возр.","убыв.");
	
КонецПроцедуры
