Перем ГСЧ;
Функция СгенерироватьПароль(ДлинаПароля, СложностьПароля) Экспорт
	ПарольНов="";
	ПарольГотов=Ложь;
	Если СложностьПароля=1 Тогда //цифры
		ГраницаНиз		= 48;
		ГраницаВерх		= 57;
		СтрокаПроверки	= "0123456789";
	ИначеЕсли СложностьПароля=2 Тогда //цифры, верх/ниж регистр.
		ГраницаНиз		= 48;
		ГраницаВерх		= 122;
		СтрокаПроверки	= "0123456789qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM";
	ИначеЕсли СложностьПароля=3 Тогда
		ГраницаНиз		= 32;
		ГраницаВерх		= 122;
		СтрокаПроверки	= "0123456789qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM!@#$%&*.";
	КонецЕсли;
	Пока Не ПарольГотов Цикл
		ПарольНов="";
		//фигачим пароль
		Для Сч=0 По ДлинаПароля-1 Цикл
			НовСимвол=Символ(ГСЧ.СлучайноеЧисло(ГраницаНиз,ГраницаВерх));
			Если Найти(СтрокаПроверки,НовСимвол) Тогда
				ПарольНов=ПарольНов+НовСимвол;
			КонецЕсли;
		КонецЦикла; 
		ПарольГотов=ПроверкаПароля(ПарольНов,ДлинаПароля,СложностьПароля);
	КонецЦикла;
	Возврат ПарольНов;
КонецФункции

Функция ПроверкаПароля(Знач Пароль,ДлинаПароля, Сложность) 
	Если СтрДлина(Пароль)<ДлинаПароля Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Сложность=1 Тогда
		СтрокаПроверки	= "0123456789";
		ФлагЦ=Ложь;
		Для Сч=0 по ДлинаПароля-1 Цикл
			Если Найти(СтрокаПроверки,Сред(Пароль,Сч,1)) Тогда 
				ФлагЦ=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат ФлагЦ;
	ИначеЕсли Сложность=2 Тогда
		СтрокаПроверки	= "0123456789";
		ФлагЦ=Ложь;
		ФлагБ=Ложь;
		Для Сч=0 по ДлинаПароля-1 Цикл
			Если Найти(СтрокаПроверки,Сред(Пароль,Сч,1)) Тогда 
				ФлагЦ=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаПроверки	= "qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM";
		Для Сч=0 по ДлинаПароля-1 Цикл
			Если Найти(СтрокаПроверки,Сред(Пароль,Сч,1)) Тогда 
				ФлагБ=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат ФлагЦ и ФлагБ;
	ИначеЕсли Сложность=3 Тогда
		СтрокаПроверки	= "0123456789";
		ФлагЦ=Ложь;
		ФлагПБ=Ложь;
		ФлагЗБ=Ложь;
		ФлагСС=Ложь;
		Для Сч=0 по ДлинаПароля-1 Цикл
			Если Найти(СтрокаПроверки,Сред(Пароль,Сч,1)) Тогда 
				ФлагЦ=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаПроверки	= "qwertyuiopasdfghjklzxcvbnm";
		Для Сч=0 по ДлинаПароля-1 Цикл
			Если Найти(СтрокаПроверки,Сред(Пароль,Сч,1)) Тогда 
				ФлагПБ=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаПроверки	= "QWERTYUIOPASDFGHJKLZXCVBNM";
		Для Сч=0 по ДлинаПароля-1 Цикл
			Если Найти(СтрокаПроверки,Сред(Пароль,Сч,1)) Тогда 
				ФлагЗБ=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаПроверки	= "!@#$%&*.";
		Для Сч=0 по ДлинаПароля-1 Цикл
			Если Найти(СтрокаПроверки,Сред(Пароль,Сч,1)) Тогда 
				ФлагСС=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат ФлагЦ И ФлагПБ И ФлагЗБ и ФлагСС;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
Иниц=Год(ТекущаяДата())*5+Месяц(ТекущаяДата())*4+День(ТекущаяДата())*3+Час(ТекущаяДата())*2+Минута(ТекущаяДата())-Секунда(ТекущаяДата());
ГСЧ=Новый ГенераторСлучайныхЧисел(Иниц);